{"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143502", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This has some great tips as always and is helping me to complete my Good Eats collection.  I haven't tried any of the recipes yet, but I will soon.  Sometimes it's just lovely to let Alton entertain us.", "overall": 5.0, "summary": "Alton... nough said", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
    {"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143529", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This is a great pastry guide.  I love how Alton's collections can break it down so baking isn't so mystical and scary.  I might even try some of these recipes some day.", "overall": 5.0, "summary": "Ah Alton...", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
    {"reviewerID": "AH3QC2PC1VTGP", "asin": "0000143561", "reviewerName": "Great Home Cook", "helpful": [2, 4], "reviewText": "I have to admit that I am a fan of Giada's cooking and I had great expectations when I ordered this set. They were however, crushed. While I still love Giada's cooking, this set is just a way for Food Network to make money. They really cheated with these DVD's. All they have are the video from the show, no text recipes, no link to the on line shows and no computer support. They play in Windows media player but the set does not contain the recipes. You can get more by taping the shows and then going to the web to download recipes. Another disappointment is the so so transfer quality to DVD. Perhaps I've been spoiled by HD and Tivo but the older shows I've recorded have had better playback quality than the episodes on the DVD's. It is in the old 480p but the quality of the transfer to DVD is dark and about the same quality as your average old VHS tape, not DVD quality. I get the impression Food Network got cheap and subbed out the DVD transfer to the lowest bidder (China?) and it shows.I could watch Giada read the dictionary and her cooking is really first rate. But, that's all you get is watching Giada. Thank god she is easy to understand and her recipes are easy to follow. But to get consistent results on some of the dishes, you should search the web and find the hard copies.  While Giada herself is great, this set is a waste of money. You're better off recording the shows and going to the web to get the recipes you want or, better yet, just stick with her cookbooks which are all first rate and worlds above this cheap presentation.", "overall": 2.0, "summary": "Don't waste your money", "unixReviewTime": 1216252800, "reviewTime": "07 17, 2008"}
    {"reviewerID": "A3LKP6WPMP9UKX", "asin": "0000143588", "reviewerName": "Anna V. Carroll", "helpful": [9, 9], "reviewText": "I bought these two volumes new and spent over $50 doing so.  You get two DVDs with three discs in each. Why would I buy DVDs if I have the cookbooks? I find watching Ina Garten cook in her kitchen very relaxing after a hectic day.  SHE is doing the cooking, not me.  SHE is having to clean up, not me.  Of course we all know she has a team to do all the prep work and clean up, but we can pretend, can't we? Lots of her earlier episodes with lots of food and friends. Lemon cakes, shrimp dishes, brownies, salads, entrees. I recently made her Szechuan Noodles and the first bowl cost me $40! That's 'cause I didn't have any of the ingredients you need to make it! But once you splurge on all the condiments, you're home free.  I have eaten Szechuan Noodles all week! I can't get enough of her recipe. Hot, cold, warm. They are SO good! That recipe is on the DVD as well. She isn't cutesy like a lot of the Food Network people.  I really dislike that.  Cute doesn't work for me.  I want someone with substance who knows what she's doing. Ina Garten is that gal. You can buy them new, like I did, or used.  Just get them both! You will find yourself in your kitchen at odd hours of the night cooking something! They're addictive. Hope she comes out with Volumes 3, 4 and on.", "overall": 5.0, "summary": "VOLUME 1 & VOLUME 2-BETTER THAN THERAPY", "unixReviewTime": 1236902400, "reviewTime": "03 13, 2009"}
    {"reviewerID": "AVIY68KEPQ5ZD", "asin": "0000143588", "reviewerName": "Rebecca Millington", "helpful": [1, 4], "reviewText": "I am very pleased with the dvd only wish i could get the only volume but unfortunately it cannot be shipped to australia.", "overall": 5.0, "summary": "Barefoot Contesst Vol 2", "unixReviewTime": 1232236800, "reviewTime": "01 18, 2009"}
    {"reviewerID": "A1CV1WROP5KTTW", "asin": "0000589012", "reviewerName": "Alberta M. Worth \"BertieMWorth\"", "helpful": [2, 2], "reviewText": "I have read many books and literature written on addiction and recovery, and the ones I find the most informative and helpful to those seeking knowledge and understanding are the ones written from individuals who have been there themselves. The school of hard knocks is I believe to be the best education and insights into how and what an addict thinks and acts comes from those who have been there from traditional education. I believe Joe Herzank's personal knowledge and insights. I recommend this DVD to anyone struggling with addiction. Thank God for those like Joe Herzank.", "overall": 5.0, "summary": "\"Why Don't They Just Qiut\" DVD Roundtable Discussion", "unixReviewTime": 1309651200, "reviewTime": "07 3, 2011"}
    {"reviewerID": "AP57WZ2X4G0AA", "asin": "0000589012", "reviewerName": "Amy Arnett-German", "helpful": [0, 1], "reviewText": "The information is good, but the presentation is very dry.  I fast-forwarded through a lot of it and wouldn't use it to show to a group as I had intended.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}
    {"reviewerID": "A3NMBJ2LCRCATT", "asin": "0000589012", "reviewerName": "Carole J. Hopkins", "helpful": [1, 1], "reviewText": "I have read the original Why Don't They Just Quit and have reviewed the DVD roundtable. I appreciate the talk being so frank and uncomplicated for anyone who is just beginning the &#34;Addiction walk&#34; most specifically as a heartbroken family member. This is a difficult time for everyone. Even if the entire book/DVD doesn't address all of the readers/viewers needs it is well worth the financial investment to buy this product. I was so impressed with its contents, I contributed my own money to the Herzaneks so extra books could be purchased and distributed to those who couldn't afford them.  Heartbroken Gramma Carole", "overall": 5.0, "summary": "Very helpful", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
    {"reviewerID": "A5Y15SAOMX6XA", "asin": "0000589012", "reviewerName": "Catherine E. Wetzler", "helpful": [12, 16], "reviewText": "I, too, purchased this to use with my patients in early recovery, an ethnically mixed urban/suburban population who complain that their families, friends,s.o.'s \"don't get it\".  If you are purchasing this to INFORM for the first time about substance abuse and why it is difficult to \"just quit\", please choose another way.  This is overly long, meanders, imparts very little useful information, and lacks energy (I'm a therapist and it put ME to sleep). I don't think it would find a connection with an audience that is hungry for \"ah-hah\" moments and some insights into their loved one's problem.  It is basically four people (all middle aged Caucasians) sitting in a darkened room around a table asking each other what they think about a range of topics.  It could have been great--personal stories, professional insights, some science, etc., but kind of comes across as a sleepy, low budget afternoon interview show.  I will keep looking.", "overall": 2.0, "summary": "C+ At Best", "unixReviewTime": 1307404800, "reviewTime": "06 7, 2011"}
    {"reviewerID": "A3P671HJ32TCSF", "asin": "0000589012", "reviewerName": "Diane Buxton", "helpful": [1, 1], "reviewText": ":Why Don't They Just Quit&#34; is a must see for those who have loved ones suffering from the disease of Addiction. Joe answers questions for us that are on this journey of being educated about this terrible disease. We show this DVD at our support group meetings on an ongoing basis.", "overall": 5.0, "summary": "A Must See", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"}
    {"reviewerID": "A3VCKTRD24BG7K", "asin": "0000589012", "reviewerName": "Eric M. Bell \"Deacon\"", "helpful": [1, 1], "reviewText": "I really enjoy watching this dvd series about drug addictions. I am intrigued as to why people feel that they need to get high and risk healh, relationship, finaces, etc", "overall": 5.0, "summary": "Great DVD", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
    {"reviewerID": "ANF0AGIV0JCH2", "asin": "0000589012", "reviewerName": "GrammaCarole", "helpful": [13, 13], "reviewText": "My 18 year old grandson has been addicted to drugs and running amok for the past 4 years. The heartaches are huge. I feel it was divine guidance for me to \"happen upon\" Joe's book and Video discussion of Why Don't They Just Quit?  The book and discussion was not only informative but so filled with hope that eventually anyone can quit if that is the choice they make. I gave the book to my grandson and he was inspired by the book. It brought comfort to me, Adam's Mom and others in the family who are struggling. It isn't over yet so this book provides us with a good roadmap from others who have travelled this road and have struggled with this issue before us.", "overall": 5.0, "summary": "Most Helpful Input I've received for my family", "unixReviewTime": 1308182400, "reviewTime": "06 16, 2011"}
    {"reviewerID": "A3LDEBLV6MVUBE", "asin": "0000589012", "reviewerName": "Jami Hyde \"Jami\"", "helpful": [10, 11], "reviewText": "The best book ever to help addicts and their friends and families. It really can help you understand the insanity of it all.  Addiction maybe one of the hardest things to wrap your mind around.  This book helps in so many ways to clear up fact from fiction!!", "overall": 5.0, "summary": "Why don't They Just Quit", "unixReviewTime": 1208995200, "reviewTime": "04 24, 2008"}
    {"reviewerID": "A1R2XZWQ6NM5M1", "asin": "0000589012", "reviewerName": "Janis G. Parker", "helpful": [3, 4], "reviewText": "Mr. Herzanek imparts heartfelt experience and knowledge in this DVD which brings strength, courage and hope in a straight forward, easy to understand manner to anyone caught in the painful web of addiction, whether it be the addict or the addict's loved one. Who better to listen to, then one who has lived through addiction to find a healthy, sane and satisfying life in continued recovery?  I contribute much of my son's recovery and my healing to Mr. Herzanek's efforts to help those of us who are desperately in need of answers and understanding with tried and true methods of overcoming this insidious disease and beginning on a rewarding road to recovery.", "overall": 5.0, "summary": "Extremely Useful Tool", "unixReviewTime": 1224979200, "reviewTime": "10 26, 2008"}
    {"reviewerID": "A36L1XGA5AQIJY", "asin": "0000589012", "reviewerName": "Jonathan Ballard \"Beauty Expert\"", "helpful": [0, 1], "reviewText": "Don't waste your money. This is a short DVD and the host is boring and offers information that is common sense to any idiot. Pass on this and buy something else. Very generic", "overall": 1.0, "summary": "Don't Waste Your Money", "unixReviewTime": 1393113600, "reviewTime": "02 23, 2014"}
    {"reviewerID": "A2HWI21H23GDS4", "asin": "0000589012", "reviewerName": "Jude R. Montarsi", "helpful": [1, 1], "reviewText": "The film contains a set of roundtable discussions with various people in the field of addiction, some of whom are former alcoholics/addicts. It's a good introduction for people who have a loved one who suffers from an addiction disorder.", "overall": 4.0, "summary": "Very good set of discussions", "unixReviewTime": 1338681600, "reviewTime": "06 3, 2012"}
    {"reviewerID": "A1DNYFL3RSXRMO", "asin": "0000589012", "reviewerName": "Judy Herzanek \". . . a Colorado Mom\"", "helpful": [10, 12], "reviewText": "", "overall": 5.0, "summary": "90 Minute DVD offers hope to families and friends", "unixReviewTime": 1208908800, "reviewTime": "04 23, 2008"}
    {"reviewerID": "A39VF226GBM1JH", "asin": "0000589012", "reviewerName": "Kathleen M. Gomes", "helpful": [8, 19], "reviewText": "I purchased this DVD with the plan that it might be useful with families of individuals in treatment. Well, it is all talk, and so shallow as to be not useful at all with this population. I am not sure what I would use it for at all. Don't waste your money.", "overall": 1.0, "summary": "If you are a professional, don't bother!", "unixReviewTime": 1218412800, "reviewTime": "08 11, 2008"}
    {"reviewerID": "ASB0E2O2FLNA7", "asin": "0000589012", "reviewerName": "Kindle Customer jmn", "helpful": [2, 2], "reviewText": "Book Review: Joe Herzanek,\"Why Don't They Just Quit\"?\"Addicts and Alcoholic's aren't crazy and they can quit.\" Joe HerzanekAs the single mother of a heroin addict, I believed addiction was a complex and confusing conundrum.  Being a control freak, I struggled to understand even the delicate changes occurring in my son.  I spent hours, days, months researching addiction, recovery and relapse, hoping to find the magic cure.  And then I was handed, \"Why Don't They Just Quit\", the award winning self-help book written by Joe and Judy Herzanek.Joe writes a powerful and honest account of his own struggle with addiction and subsequent successful recovery, thirty years strong.  He provides valuable and often misunderstood insights from the addict's point of view, offering amazingly simple reasons for why the addict does not quit.\"Consequences became a reason for using, not a deterrent\" Joe explains as he explores reasons addicts just don't quit.  Drugs dull the senses, numb the pain and fade the situations, allowing the addict an escape from their problems. \"People use drugs to increase pleasure and decrease pain,\" writes  Joe.\"Families and friends always try to help the addict see the problem. It doesn't happen over night. They do not see the problem as it unfolds; this person typically is in denial. They will typically put this off rather than confront.\" Joe HerzanekDespite mounting pressures, whether financial, social, legal or emotional, the addict cannot see the problem for what it has become; rather the mounting pressures become the reason to continue using, in order to NOT deal with them. It seems so obvious when Joe describes the stress and the inability to deal with it that creates the vicious cycle I helplessly watched my son spiral through.Joe recounts personal failures and near tragic family circumstances as a result of addictions, but also provides a road map of sorts to navigate through the cause and progression of addiction, the treatment options as well as common sense answers to not so simple questions.In \"Why Don't They Just Quit\" Joe aptly dispels the myth of hitting rock bottom:\"This whole idea of \"hitting bottom\" is out of date. Some people with wait years-even decades- for their friends to reach thus mythical point in their alcohol and drug use. But why wait for them to \"hit bottom\"? Why not help them by raising their bottom? There are ways to encourage someone to reach their bottom much earlier. In doing so. We can avoid a lot of unnecessary pain and heartache- and maybe even save their life. For some people, hitting bottom will be six feet underground\". Joe HerzanekAs I struggled to `tough love' it with my son, I never thought of it as raising his bottom. I only looked at as a way to preserve my sanity, and then only after I attempted to help my son, which really meant enabling the behavior to continue.\"So does everyone have to hit rock bottom? I would say no. Tough love can prevent a substance abuser from prolonging their usage. There are loving ways to refuse to rescue someone that in the long run will help them to choose recovery.\"Loving means doing the right thing to help.\" Joe HerzanekJoe leaves no stone unturned when it comes to addiction and its far-reaching consequences. Addiction affects the entire family, from spouses, to parents, to siblings.Full of useful quotes and quips from both famous and not so famous, as well as personal adages from his family and friends, Joe Herzanek takes a very messy, complex and taboo subject, and twists it into a story of hope, courage and healing \"Quitting is a moment in time. It is not recovery\" Joe warns the reader.  He provides treatment options and despite being a chaplain, he tempers his own faith with the 12-step `higher power\".\"The last thing I want to do in this section is to get too preachy. Spiritual growth is very personal. What I am saying is that spirituality is a big part of recovery and is too important to ignore.\" Joe HerzanekI highly recommend this read to any person living with or loving an addict. A toolbox of helpful insights, answers to seemingly impossible questions, and road map through the struggles of addiction; this book is the ultimate idiots guide to addiction, recovery and relapse, and a must to all struggling in this realm.", "overall": 5.0, "summary": "Why Don't THEY Just Quit?", "unixReviewTime": 1322956800, "reviewTime": "12 4, 2011"}
    {"reviewerID": "A19E15Y9V09CVJ", "asin": "0000589012", "reviewerName": "Mari L. Nelson", "helpful": [7, 9], "reviewText": "I recently purchased the DVD and book on \"Why Don't They Just Quit\" by Joe Herzanek.  Having a son with a severe alcohol/drug abuse problem, who has been through more than one treatment program, I was desperately looking for answers, not hype or glitter. I found the \"roundtable\" format on the DVD to be easy to follow. I consider \"Why Don't They Just Quit\" to be my \"Bible\" on drug abuse issues affecting the addict and the families. Mr. Herzanek lays it out in a straightforward way, using his and other's personal experiences to clarify the how and why of addiction and recovery.  This is a must have tool for anyone that is impacted by a loved one's addiction.", "overall": 5.0, "summary": "A Must Have Tool", "unixReviewTime": 1224806400, "reviewTime": "10 24, 2008"}
    {"reviewerID": "A3K979KQ7K0S5K", "asin": "0000589012", "reviewerName": "Michael Z www.TheWisdomoftheRooms.com", "helpful": [3, 4], "reviewText": "If you've ever wondered why a loved one or friend continues to destroy their lives (and/or others), and wished you knew what you can and cannot do, then watch this video over and over again - the answers are there if you're willing to hear them.  Joe, and the round table members, do an excellent job at tackling the tough questions - and answers - on addiction.  You'll get no dramatic enhancements here, just straight questions and REAL answers on what addiction is, why people don't stop, and what you can do to help them.  There are many books, TV programs, and videos out there, but none that match the straightforward truth you'll find here. If you need help, then watch this video with your family - and then follow its suggestions.  You'll be happy you did.", "overall": 5.0, "summary": "At last, the REAL answers on Addiction", "unixReviewTime": 1251158400, "reviewTime": "08 25, 2009"}
    {"reviewerID": "A39ZX6X5H2N4TS", "asin": "0000589012", "reviewerName": "Mom of Two", "helpful": [8, 8], "reviewText": "Through this outstanding book and accompanying dvd, our family was able to begin the healing process and move away from he horrors of living with an addict among us.  The video discussions were meant to be catalysts, we felt, catalysts toward the process of opening a dialogue within our family, and our minds individually.  When one family member falls ill from the disease of addiction, everything is seen through a shattered mirror from everyone.  Joe Herzanek's exceptional book, his wisdom, and plethora of real life experiences were, for us, such a positive resource, along with the dvd roundtable discussions --- active and accurate learning tools and examples of the whats and how tos that parents and siblings need.  His advice put us on the path to really help our son.  Dealing with and recognizing the fact that one has this disease is a slow, and evolving process that calls for intense work, introspection, commitment, and more.  It also requires that a family make a paradigm shift away from accusations to the addict and past unworkable behaviors, toward taking baby steps to forgiveness, a return to love, health and focus on one day at a time.  We found it to be an invaluable reference, and have gone back to visit it many times.  Keeping an open mind is vital to dealing with addiction. Reading, learning, listening, discovering, all are a part of the process. And, there is a need for a sense of reality and the inherent value of the Twelve Step Program for parents and siblings as well.", "overall": 5.0, "summary": "Food for Thought and Action:What Can Change Our Lives", "unixReviewTime": 1308182400, "reviewTime": "06 16, 2011"}
    {"reviewerID": "A2Z3ZHQI6YXKHH", "asin": "0000589012", "reviewerName": "Nancy Kinney", "helpful": [2, 2], "reviewText": "Our church's addictions ministry is using this DVD for training and at their support group sessions. Highly recommended for personal or professional use.", "overall": 5.0, "summary": "Good Resource DVD", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
    {"reviewerID": "A2RNKU9KJHQ2BV", "asin": "0000589012", "reviewerName": "Nancy Price (flags@pld.com)", "helpful": [2, 2], "reviewText": "Excellent discussion of alcohol and the recovery process.  I would highly recommend this video to treatment centers and the aftercare programs.  It is a bit long for classroom settings, but could be broken into different sessions to showing to the younger students.  I highly recommend this video for the information presented", "overall": 5.0, "summary": "Why don't they just quit", "unixReviewTime": 1363219200, "reviewTime": "03 14, 2013"}
    {"reviewerID": "A30WLYNJA3B17H", "asin": "0000589012", "reviewerName": "Ned Wicker", "helpful": [8, 11], "reviewText": "There is a tug-of-war going on in the recovery community between those with academic letters behind their names and those who have walked through the tunnel of addiction. For example there are those who believe AA is a positive road to walk on, while others scorn AA for any number of reasons. Joe Herzanek writes and talks about addiction with a warmth and depth of understanding that so many others lack. \"Why Don't They Just Quit\" is superbly written, a straight-talking, no frills guide for people to follow. It's a great resource. Herzanek has walked through the tunnel of addiction and can relate to those who struggle. He understands families and what they go through. The book and DVD make a human connection, beyond the facts of addiction.", "overall": 5.0, "summary": "Human Connection and Compassion", "unixReviewTime": 1224720000, "reviewTime": "10 23, 2008"}
    {"reviewerID": "A3LI15T4YR5WD6", "asin": "0000589012", "reviewerName": "R. Burgie", "helpful": [1, 3], "reviewText": "Why Don't They Just QUIT? DVD Roundtable Discussion: What families and friends need to know about addiction and recovery.This DVD, along with the book, are about the only tools available to us loved ones on the outside, who want to help a substance abuser begin the spiritual journey to healing, peace, and rest.  It is perfect to start one's own education about this insidious disease, and then to share it with the rest of the family and friends, who may not have the time to read a new book, but will take a few hours to watch a DVD.  That open door is all it will take.  Before I found these resources, I felt alone in my search, finding nothing but professional enablers (those in the counseling and legal professions) whose expensive and poor advice only allows the cycle to continue.  May God bless you with courage in your quest to find answers.", "overall": 5.0, "summary": "Opening the door", "unixReviewTime": 1226102400, "reviewTime": "11 8, 2008"}
    {"reviewerID": "AV3UWBH6K0ETD", "asin": "0000589012", "reviewerName": "Ronald E. Miller", "helpful": [2, 3], "reviewText": "Was a bit slow.  Did have some good information but still very dry I thought.  I do use if for educational services.", "overall": 2.0, "summary": "Why Don't They Just QUIT?", "unixReviewTime": 1334966400, "reviewTime": "04 21, 2012"}
    {"reviewerID": "A312A70K5UUL1N", "asin": "0000589012", "reviewerName": "Russ", "helpful": [0, 1], "reviewText": "this has to be one of the most dry and boring dvd i have bought, i think it was a waste of money. i showed it to my clients and they asked if we had to watch it after 10 minutes..", "overall": 1.0, "summary": "boring", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
    {"reviewerID": "A23PSBNOBPLCOM", "asin": "0000589012", "reviewerName": "russtacean", "helpful": [1, 1], "reviewText": "This is a truly important work... one that anyone affected by substance abuse either directly or indirectly should see.When i was in art school years ago, one day a friend of mine who was also a classmate didn't show up for class. It was very unusual as he was always first there and one of the most talented and prolific artists - not only in the freshman class, but in the whole college. He was always drawing and, although very reclusive in his personal life, was well liked and admired. i learned quickly that he had overdosed. Sadness and deep grief do not even begin to describe the loss of Gary. i still feel empty when i think of him like when the wind blows, i feel like it can go right through me.The reason i was so glad to have learned of this great book and of Joe's having been there realism, is that it has given me some closure on some level about my friend. No other work has come close and for that i am eternally grateful.It's an honor for me to have a chance to write this.respectfully and with deep regard and thanks,russ", "overall": 5.0, "summary": "An insightful, provocative tool... very powerful and overwhelmingly real.", "unixReviewTime": 1309910400, "reviewTime": "07 6, 2011"}
    {"reviewerID": "ATEOWCA0EHRQR", "asin": "0000589012", "reviewerName": "S. Chism", "helpful": [4, 6], "reviewText": "I purchased this DVD and was very excited to find some answers that you don't get anywhere else.  This book gives you an insight from the addict himself to understand the distorted thinking that comes with addiction.  It will help you better understand and relate to the addict in your life.  I actually bought several books and gave one to a Psychiatrist and he loved it and is reccomending the book to family of alcoholics as well as addiction.  Thank you so much for creating this helpful book and DVD!!!!!  We love them!  And we are happy that you are wanting to help people and families who are affected from a disease that is beyond their control!", "overall": 5.0, "summary": "Awesome!!!", "unixReviewTime": 1225670400, "reviewTime": "11 3, 2008"}
    {"reviewerID": "A2T8A34ZSAXGHA", "asin": "0000589012", "reviewerName": "SharonLong", "helpful": [2, 3], "reviewText": "\"Why Don't They Just Quit\" could not hold my attention that I wouldn't even dare to bore my adult substance addiction therapy group with it. To show this to a population of substance abusers would put them to sleep. The kind of addiction films that stimulate my clients are the ones that explain how they got addicted, why they are addicted, and what can be done about it from a psychological, biological, and physiology perspective. Psychological, biological, and physiological films make them feel as if they are a person first with some issues, instead of making them feel they are labeled as a problem with the identity of an alcoholic or addict (a person second) in which this DVD takes that position. Good addiction films today move fast, scene to scene, with music in background and people talking scene to scene with speed. This DVD has the same two or four people sitting around a table talking about \"the alcoholic or drug user\" with the same monotone voices. The background is black and has a bowl of fruit to look at on the table but doesn't even have something to look at in the background such as cars going by in a window or pictures or a bookshelf. This DVD definitely isn't for substance user/abuser audience or a therapist that already has knowledge about addictions. It is more suited for those that don't know anything about addictions and who doesn't have substance-using issues. I would recommend this DVD for family members experiencing a love one with using issues or a student first learning about addictions for their studies in the mental health or medical field because the DVD pretty much covers all the basics A to Z about understanding a person with alcohol or drug issues. I also recommend, to really get to know what a substance user is experiencing is to attend a few AA and/or NA speaker night meetings to hear how they journeyed through their recovery process.", "overall": 2.0, "summary": "Not for substance user audiences", "unixReviewTime": 1364083200, "reviewTime": "03 24, 2013"}
    {"reviewerID": "A3G3WG4UMDSF8M", "asin": "0000589012", "reviewerName": "Tammy Kinsey", "helpful": [3, 3], "reviewText": "\"Why Don't They Just Quit\" is a must have book, and DVD round table discussion combo. I know from experience watching a love one suffer from addiction, how painful this is for the addict and the family. Most of the times the family does not know much about addiction or what it looks like exactly, all they know is their family structure is in jeopardy. The roundtable opens up many avenues of discussion of what addiction looks like, how it affects the family, and there are solutions. Yes, there are solutions!!! The round table givens valuable advice on many other questions you may have. Questions dealing with relapse, intervention techniques, in addition to what works, and what does not work for addicts, and their families. Joe and the round table members do an excellent job at discussing all the issues of addiction and recovery. Did you notice I said \"recovery?\" There is hope and this book along with round table discussion will help you on the path to recovery. If you are having addiction issues, or you are a family member watching someone with addiction issues this is a must have. Very insightful and positive...", "overall": 5.0, "summary": "A must have for someone suffering from addiction", "unixReviewTime": 1308700800, "reviewTime": "06 22, 2011"}
    {"reviewerID": "A3LHVMF6OJXJNM", "asin": "0000589012", "reviewerName": "The Specialist Publishing Company", "helpful": [1, 1], "reviewText": "Very interesting and informative.  Helps one understand the complicated disease of alcoholism and other addictions.  I highly recommend it for everyone.", "overall": 4.0, "summary": "Alcoholism Explained", "unixReviewTime": 1401408000, "reviewTime": "05 30, 2014"}
    {"reviewerID": "A35ZSFP89PWC5B", "asin": "0000589012", "reviewerName": "Wallet", "helpful": [1, 1], "reviewText": "This is a great family movie to watch for those who have substance addiction. It helps everyone understand the addiction stage better.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
    {"reviewerID": "ALQGU53I8TCU6", "asin": "0000695009", "reviewerName": "Brian Craven", "helpful": [0, 0], "reviewText": "It help peoples to understand about Epilepsy It is one of the main one if you can buy it buy it it can be very hard to buy from", "overall": 4.0, "summary": "It is another good one is very short", "unixReviewTime": 1365724800, "reviewTime": "04 12, 2013"}
    {"reviewerID": "A1XU4NX76WRGZM", "asin": "0000791156", "reviewerName": "Maria \"wishfulone\"", "helpful": [0, 0], "reviewText": "I am extremely satisfied with this purchase and wish I could have more resources by Pstr Prince.I have yet to know a lot about the gospel of Grace...but i am so glad to have started the journey. Thank you Jesus.", "overall": 5.0, "summary": "Exceedingly glad", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
    {"reviewerID": "A1Z6CDRFVIHES5", "asin": "000107461X", "reviewerName": "garland kimble", "helpful": [0, 0], "reviewText": "the music was everything that I wanted. Would order again because the service was quick and very satisfactory. Looking to order more", "overall": 5.0, "summary": "Excellent!,,,", "unixReviewTime": 1359849600, "reviewTime": "02 3, 2013"}
    {"reviewerID": "AR6RBE9S8XZ8C", "asin": "0001485423", "reviewerName": "Happy Customer", "helpful": [0, 0], "reviewText": "Very good information on the Divine Mercy. Learned much about Sister Faustina and appreciate her example and what she has done for her Catholic faith.", "overall": 5.0, "summary": "Inspiring movie", "unixReviewTime": 1363219200, "reviewTime": "03 14, 2013"}
    {"reviewerID": "A2X0GJ1KR9B8U0", "asin": "0001516035", "reviewerName": "GW \"GW\"", "helpful": [0, 0], "reviewText": "I was pleasantly surprised with this one. Really nice to see happy, smiling, Don Moen singing upbeat songs and even dancing early on in the video. Very cool!", "overall": 5.0, "summary": "Worship with Don Moen", "unixReviewTime": 1335830400, "reviewTime": "05 1, 2012"}
    {"reviewerID": "A1Z1NDXGCNMEST", "asin": "0001517791", "reviewerName": "Kathy S Korn", "helpful": [0, 0], "reviewText": "I purchased a used video because mine was ruined. I love this tape. No matter how often I use it, I get a great workout and the music lifts my spirit every time.", "overall": 5.0, "summary": "Great Workout", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"}
    {"reviewerID": "A2GWNIH0RTOM67", "asin": "0001517791", "reviewerName": "Seysme", "helpful": [0, 0], "reviewText": "I went to a church aerobics class in the early 90's where they used this workout. I loved it so much I decided to buy one for myself. I have used this workout off and on over the years and have never stopped loving it. It is not only a well balanced workout, but the outstanding and timeless (scripture memory) music is good for lifting your spirit and getting you exciting about serving God. It features low, med and high intensity for all levels of ability. It is a pretty easy workout; however, the steps are a little hard to learn at first, but once you learn then it feels like flying...lot of fun!", "overall": 5.0, "summary": "Fun workout and a good time with the Lord!", "unixReviewTime": 1294790400, "reviewTime": "01 12, 2011"}
    {"reviewerID": "A2DZ09ET7S7ISG", "asin": "0001526863", "reviewerName": "Amy", "helpful": [3, 3], "reviewText": "My children love these videos, and I love hearing them sing the Scripture songs over and over and over again . . .", "overall": 5.0, "summary": "GREAT!", "unixReviewTime": 1184716800, "reviewTime": "07 18, 2007"}
    {"reviewerID": "A1PRCGRSAJMIFW", "asin": "0001526863", "reviewerName": "denise", "helpful": [1, 1], "reviewText": "I love this video and so does my little girl.Is there anything better than hearing my 3 year old going around singing \"Christ who strengthens me\" or \"Overcome evil with good\"?Tunes are so catchy---I sing them myself!", "overall": 5.0, "summary": "Couldn't be happier!", "unixReviewTime": 1301529600, "reviewTime": "03 31, 2011"}
    {"reviewerID": "A1TN0V94A3ECSH", "asin": "0001526863", "reviewerName": "Karilyn S. Eastvold", "helpful": [0, 0], "reviewText": "Attractive, memorable video featuring songs that are catchy and easy to learn.  Great way to write the Word of God on young hearts.  Works for parents too--they like the songs and learn the verses with little effort.  Children love these videos.", "overall": 5.0, "summary": "Hide 'Em in Your Heart", "unixReviewTime": 1254009600, "reviewTime": "09 27, 2009"}
    {"reviewerID": "A3W3EB24TA5BSI", "asin": "0001526863", "reviewerName": "Mommyof8", "helpful": [0, 0], "reviewText": "It really works! The children love watching it and before I knew it we were all singing scripture! Do not be overcome with evil, but overcome evil with good! The songs really do get stuck in your head. Very sweet video.", "overall": 5.0, "summary": "Sweet!", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}
    {"reviewerID": "A2647CKYEBQE7N", "asin": "0001526863", "reviewerName": "Patricia Fredrick", "helpful": [0, 0], "reviewText": "This video was the one I had been looking for.  Video was shipped quickly and worked fine.  Video provides songs to help kids learn Bible verses.", "overall": 5.0, "summary": "Item just as described", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
    {"reviewerID": "A3478QRKQDOPQ2", "asin": "0001527665", "reviewerName": "jacki \"jacki\"", "helpful": [0, 0], "reviewText": "really happy they got evangelised .. spoiler alert==happy ending liked that..since started bit worrisome... but yeah great stories these missionary movies, really short only half hour but still great", "overall": 5.0, "summary": "great", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
    {"reviewerID": "A3KROYMQ61M7A", "asin": "0005004101", "reviewerName": "Rich The Reviewer", "helpful": [2, 3], "reviewText": "See also: Jehovah's Witnesses: A Non-'Prophet' Organization. Started by 33rd degree Masonic Pyramidologist Chas.Taze Russell, in 1874 as the 'Russel-ites'. These poor people are badly bam-boozled. They need our prayers and th-is video / book (if you can still findit) are a step in the right direction!", "overall": 4.0, "summary": "Very Fine Jeremiah Films production of this pernicious cult...", "unixReviewTime": 1151798400, "reviewTime": "07 2, 2006"}
    {"reviewerID": "A1FDW1SPYKB354", "asin": "0005019222", "reviewerName": "David Von Pein", "helpful": [1, 1], "reviewText": "\"The Homecoming -- A Christmas Story\"(full on-screen title) was made in 1971, and was the start of CBS-TV's very successful series, \"The Waltons\". And what a great way to start! Patricia Neal gives a powerful performance as Olivia Walton, the head of the very large Walton clan.This entire cast, in fact, seems ideally suited for his/her role in this film. The true feeling and spirit of the holiday shines through in every single scene of \"The Homecoming\", with the producers re-creating a very realistic feeling that it is indeed Christmas 1933, during the height of The Great Depression. The writing, acting, and the atmosphere are all first-rate.This is one of those programs that begs to be watched every Christmas Eve, just like clockwork.Who could forget the great scene at the end of the movie, when John (Daddy Walton, played by Andrew Duggan) tells the family of his encounter with Santa Claus. Watching him tell the kids of how Santa's sleigh \"...went flying across the sky and landed right on top of this house!!\", to me, is one of the best scenes in television history.When viewing that realistic scene, you'd swear those children were not actors at all -- but just wide-eyed excited kids hanging on their father's every word.In addition to the \"Santa's Sleigh\" scene I just mentioned, there are so many other memorable moments in this made-for-TV movie as well. Such as:>> The kids hearing the sleigh bells when they're supposed to be asleep...thinking it's Santa Claus.>> \"We've got to have some gas.\" :)>> The sleigh ride through the woods late on Christmas Eve, with the \"Baldwin Ladies\", John-Boy, and Hawthorne Dooley.>> The tree decorating scene, punctuated by Mary Ellen calling her siblings \"a bunch of piss ants\". (I was always a little surprised that \"piss ants\" got past the CBS censors.) ;)>> \"Are you smoking cigarettes up here, John-Boy??\" ~LOL~>> Mary Ellen and John-Boy's private talk in the barn while John-Boy is milking the cow. ... \"They'll grow.\" :)>> John-Boy telling a Christmas story to his brothers and sisters on the stairs just before their daddy returns home.>> When John-Boy finally confides in his mother, and reveals to her what his secret ambition is.Every moment in this movie is to be treasured. Always.---------------------------\"The Homecoming -- A Christmas Story\" will forever be one of the very best Christmas movies ever made, in my opinion.Thank you, Earl Hamner Jr., for this timeless holiday staple.", "overall": 5.0, "summary": "\"THE HOMECOMING\" -- A Timeless Holiday Treasure!", "unixReviewTime": 1175817600, "reviewTime": "04 6, 2007"}
    {"reviewerID": "A8DEM9HR8QORQ", "asin": "0005019281", "reviewerName": "Alfred Santa Cruz", "helpful": [0, 0], "reviewText": "my family really enjoyed this movie. hoping to find the dvd in stores someday. might have to order on line. thanks for the choice of classic shows.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "ADZPIG9QOCDG5", "asin": "0005019281", "reviewerName": "Alice L. Larson \"alice-loves-books\"", "helpful": [0, 0], "reviewText": "This is a charming version of the classic Dicken's tale.  Henry Winkler makes a good showing as the \"Scrooge\" character.  Even though you know what will happen this version has enough of a change to make it better that average.  If you love A Christmas Carol in any version, then you will love this.", "overall": 4.0, "summary": "good version of a classic", "unixReviewTime": 1203984000, "reviewTime": "02 26, 2008"}
    {"reviewerID": "A35947ZP82G7JH", "asin": "0005019281", "reviewerName": "Amarah Strack", "helpful": [0, 0], "reviewText": "It was good but not as emotionally moving as the the Christmas Carol by Dickens  I like Christmas movies that make me sigh", "overall": 3.0, "summary": "Good but not as moving", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "A3UORV8A9D5L2E", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Don't get me wrong, Winkler is a wonderful character actor and I would rate 95% of his performances as B+ or A, however, he was not very convincing in the starring role of &#34;An American Christmas Carol.&#34;  I'd give it a C or C+ at best.  Ayyyyy!", "overall": 3.0, "summary": "Winkler's Performance was ok at best!", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "A32MMXBE8TZEHO", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Henry Winkler as Slade was great. Good cast and I enjoyed the movie very much.  I am adding it to my list of favorite holiday movies.", "overall": 5.0, "summary": "Great twist on the classic", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
    {"reviewerID": "A2S8D0QSJZ07DJ", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "i have always liked this movie it was suppose to be based in my home town which made it more interesting.  It still follows the story line of Charles Dickens with the ghosts and all but still a very good story.", "overall": 5.0, "summary": "great show", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
    {"reviewerID": "A12PD8MX7BQW45", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I remember seeing this when it was first broadcast on TV. I loved it then and loved being able to watch it on DVD for the first time in almost 30 years. Other reviewers have provided story details, so I'll just say that this is a sweet movie that has aged well. If you are already considering this purchase then you are bound to like it.", "overall": 5.0, "summary": "Great retelling in an Amercan Setting", "unixReviewTime": 1212192000, "reviewTime": "05 31, 2008"}
    {"reviewerID": "A1RZSB9J891SCK", "asin": "0005019281", "reviewerName": "Amazon Customer \"I'm a book lover, what can I...", "helpful": [2, 2], "reviewText": "This is one of my two favorite adaptations of this classic. Henry Winkler plays an outstanding Scrooge character and this is my favorite role of his, cheesy moustache notwithstanding.You will also find many great lines about life (look for the comment about \"the larger state\", \"records\" & \"if\").Buy this movie, you won't regret it.", "overall": 5.0, "summary": "Henry Winkler's best", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
    {"reviewerID": "A1VKW06X1O2X7V", "asin": "0005019281", "reviewerName": "Amazon Customer \"Softmill\"", "helpful": [0, 0], "reviewText": "Henry Winkler is very good in this twist on the classic story. Not a conventional remake, but a version of the story set in early America. Give it a try.", "overall": 5.0, "summary": "It's an enjoyable twist on the classic story", "unixReviewTime": 1202860800, "reviewTime": "02 13, 2008"}
    {"reviewerID": "A3M1I3T6RCU13B", "asin": "0005019281", "reviewerName": "Angela L. Patrick", "helpful": [0, 0], "reviewText": "I have always loved the Christmas Carol, and this version doesn't disappoint. Henry Winkler plays a great &#34;Scrooge&#34;. I loved it!", "overall": 5.0, "summary": "Lovely version", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
    {"reviewerID": "A9ET89HFL6H5V", "asin": "0005019281", "reviewerName": "Anna Koglin", "helpful": [0, 0], "reviewText": "Doesn't matter the time or the place we are in life, we should always look at ourselves and reflect on how we can make a difference in our world.", "overall": 5.0, "summary": "One of the best!", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
    {"reviewerID": "A655QKT9RZE22", "asin": "0005019281", "reviewerName": "Anthony Dipoalo", "helpful": [0, 0], "reviewText": "I remember watching this as a kid on prime time television.  I love this unique version of a Christmas Carol.", "overall": 4.0, "summary": "I love this unique version of a Christmas Carol", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
    {"reviewerID": "A204IS3LM0G5WR", "asin": "0005019281", "reviewerName": "atmjinc", "helpful": [0, 0], "reviewText": "I thought the movie was great when it came out in 1979 and still think it's great today. This is a good movie for the whole family to watch; however, not sure if the kids of today would appreciate it.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
    {"reviewerID": "A2EKHROPDGU1XE", "asin": "0005019281", "reviewerName": "babear \"babear54\"", "helpful": [0, 0], "reviewText": "I was so excited to get a dvd of \"an american christmas carol\".the quality is great and the service was excellent. this is one of our favorite christmas movies.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1229040000, "reviewTime": "12 12, 2008"}
    {"reviewerID": "A3R27T4HADWFFJ", "asin": "0005019281", "reviewerName": "BABE", "helpful": [0, 0], "reviewText": "This is one of the best Scrooge movies out.  Henry Winkler outdoes himself.  The casting is excellent and the music and theme old but very relevant.", "overall": 4.0, "summary": "Best Scrooge yet", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
    {"reviewerID": "A2L0G56BNOTX6S", "asin": "0005019281", "reviewerName": "barbara whapeles", "helpful": [0, 0], "reviewText": "This has been a favorite movie of mine for a long time.  Henry winkler is great as a modern day Scrooge.  There are many movies giving a new twist to Dickens, but this one is true to the original story.  It is set during the depression.", "overall": 5.0, "summary": "Dickens updated.", "unixReviewTime": 1383696000, "reviewTime": "11 6, 2013"}
    {"reviewerID": "A5NYUBEKXFLX5", "asin": "0005019281", "reviewerName": "B. Babb \"kites0852\"", "helpful": [1, 1], "reviewText": "This is the American adaptation of the Charles Dickens' classic.  It is interesting that in the movie the main character is seen ripping the pages out of a collector's item book of \"A Christmas Carol.\"Henry Winkler gives an outstanding performance as Benedict Slade, a loan officer who reclaims valued possessions of those unable to make late payments on Christmas Eve.His visit by the spirits, the life in the orphanage and how one man helped him, leads to a very sentimental ending.It would have been good if the images could be enhanced for better viewing.  This originally was a 'made-for-TV' program and is presented complete with the fade-outs for the commercial breaks.David Wayne gives a great performance as the book owner as well as Christmases past.", "overall": 5.0, "summary": "A MUST-HAVE FOR ANY VIDEO CHRISTMAS COLLECTION!!", "unixReviewTime": 1230595200, "reviewTime": "12 30, 2008"}
    {"reviewerID": "A2WT7U5CFGZZZ4", "asin": "0005019281", "reviewerName": "Beak", "helpful": [0, 0], "reviewText": "This is an excellent movie.  I had not seen it for many years.  It used to be on television every Christmas, but not in the last several years.  I checked Amazon and there it was.  I watched with my daughter the other night - she had never seen it before.  She enjoyed it.  Well worth watching.", "overall": 5.0, "summary": "Excellent Movie", "unixReviewTime": 1323043200, "reviewTime": "12 5, 2011"}
    {"reviewerID": "APC04EXUKDQJ6", "asin": "0005019281", "reviewerName": "Beansisme", "helpful": [0, 0], "reviewText": "I really can't complain about the shopping experience; that was great.  I loved this movie when I originally saw it but like so many things in life it wasn't so good the second time.", "overall": 3.0, "summary": "Very fast delivery", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"}
    {"reviewerID": "A2DJ8B8GE4V2VD", "asin": "0005019281", "reviewerName": "Berl S. Meyer", "helpful": [0, 0], "reviewText": "Glad that this american classic came out on dvd.  I have been waiting for it for a long time.  I haven't seen this production since it came out years ago.  Plus it's better than some Hallmark holiday movies.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1260835200, "reviewTime": "12 15, 2009"}
    {"reviewerID": "AWF2S3UNW9UA0", "asin": "0005019281", "reviewerName": "beth holman", "helpful": [0, 0], "reviewText": "A good Christmas carol dhenry winkler one during the depression. Henry winkler does a good job.a classic film I recommend for all ages.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
    {"reviewerID": "A3OOCXQFN0GPH1", "asin": "0005019281", "reviewerName": "Betterat50", "helpful": [0, 0], "reviewText": "My brother loves this Henry Winkler version of A Christmas Carol called \"An American Christmas Carol\" and wanted it for his DVD Christmas collection. Its not in the stores and my brother was too cheap to purchase a DVD over $20, so it was the perfect gift!  I also purchased the suggested \"Most Wonderful Time of the Year\" with Henry Winkler, my brother hasn't watched it yet but said he has never seen it before, so I was happy Amazon suggested it also.  They arrived quickly and securely, overall 5 stars of happiness with Amazon.", "overall": 5.0, "summary": "Great gift!", "unixReviewTime": 1325548800, "reviewTime": "01 3, 2012"}
    {"reviewerID": "A3O4UUT83DG3OU", "asin": "0005019281", "reviewerName": "Bettylou Sperling", "helpful": [0, 0], "reviewText": "How a bitter old man comes to know the true meaning of Christmas. Realizing to late his lost love and life.", "overall": 5.0, "summary": "Fantastic!", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}
    {"reviewerID": "A3TK5Q142X5Q8A", "asin": "0005019281", "reviewerName": "BluegrassGirl \"Mother Nature\"", "helpful": [0, 0], "reviewText": "The small historic Canadian town of Elora, with its many century-old buildings, is the perfect setting for this story, set in the early 1900's.  Bringing the story to 20th century America allows the story to incorporate situations Americans can more easily with.  Henry Winkler does a great job of recreating the Scrooge character, and the supporting cast are no less admirable.  This is an annual &#34;must watch&#34; story for me.", "overall": 5.0, "summary": "Outstanding Concept, and Performances", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A384DLXD0474VH", "asin": "0005019281", "reviewerName": "Bob S. \"Classical Music Fanatic\"", "helpful": [0, 0], "reviewText": "We'd taped this from TV years ago and I was delighted to find this version on Amazon.  Winkler is fantastic as the Scrooge character.  While the story-line has been modified to be early 20th century New England the elements of the original Dickens story are preserved in this version.  I'm a \"Christmas Carol\" fanatic and this is a super addition to my collection.  Buy it- you won't be disappointed!", "overall": 5.0, "summary": "A WONDERFUL VARIANT OF THE DICKENS 'CHRISTMAS CAROL' STORY", "unixReviewTime": 1204156800, "reviewTime": "02 28, 2008"}
    {"reviewerID": "A18OILI6QL3F6D", "asin": "0005019281", "reviewerName": "brianbomber123", "helpful": [0, 0], "reviewText": "Good fun movie for the holidays nice different version of A Christmas Carol like the characters but it could have been longer", "overall": 5.0, "summary": "fun Christmas movie", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
    {"reviewerID": "A3EWY61AK57EIW", "asin": "0005019281", "reviewerName": "briceynanny", "helpful": [0, 0], "reviewText": "This arrived in good time. It was in good condition. I haven't had a chance to watch it yet. I am happy with this purchase so far.", "overall": 4.0, "summary": "American CC DVD", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
    {"reviewerID": "A33EWPXESP9GQH", "asin": "0005019281", "reviewerName": "Buckaroo \"Dead Dog\"", "helpful": [0, 0], "reviewText": "Even though i don't care for Henry Winklers  acting i liked this movie it fit him real good ThanksDale", "overall": 5.0, "summary": "Good Version", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
    {"reviewerID": "AG8D804FUG5Y4", "asin": "0005019281", "reviewerName": "Bud Harris \"Bud 101\"", "helpful": [0, 1], "reviewText": "My wife told me of this movie in which Henry Winkler stars & shows he can act in this different version of a Chrismas Carol.", "overall": 3.0, "summary": "Christmas", "unixReviewTime": 1199836800, "reviewTime": "01 9, 2008"}
    {"reviewerID": "A1GHUN5HXMHZ89", "asin": "0005019281", "reviewerName": "C. A. Luster \"The Rook\"", "helpful": [0, 0], "reviewText": "The first time I saw &#34;An American Christmas Carol&#34; I immediately fell in love with it.  I didn't grow up during the Great Depression but my father did and he told stories that made it real for me.  This re-imagination of an Americanized Scrooge during the Depression is wonderful.  The story, acting, directing, camera work, costumes, sets, locations, music, and all production values are great.  I have always enjoyed Henry Winkler as an actor, but I think this is by far one of his best if not the best performance of his career to date.  I highly recommend it for the whole family.CA Luster", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
    {"reviewerID": "A1SA1Z504112YI", "asin": "0005019281", "reviewerName": "Carfo \"Station Guy\"", "helpful": [0, 0], "reviewText": "I worked for an ABC station in the 70's and early 80's so I knew and watched when this movie first aired.  I wasn't expecting a great show, just one of those expositions of ABC stars like \"Love American Style\" was in that error.  I was very surprised and my wife even cried.  This is a well written, well directed and edited movie.  Not corny but as the title denotes, with a script that moves away from the original script.  In this era of NAFTA and trade treaties this message is as timely as it was in the period of the movie.  Also Henry Winkler, who obviously plays the character in several ages, does a great job.", "overall": 5.0, "summary": "The Fonz delivers a \"carol with a twist\"", "unixReviewTime": 1324512000, "reviewTime": "12 22, 2011"}
    {"reviewerID": "AQD623IKMVSGL", "asin": "0005019281", "reviewerName": "Carin Misterly", "helpful": [0, 1], "reviewText": "Horrible movie.  Why Henry Winkler.........why?  The make up was terrible the sets were subpar.....I get it was '80s made for TV, but it brought our evening down fast.  Love the Winkler....no likely this movie..", "overall": 1.0, "summary": "Noooooooooo!!!!!!!!", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
    {"reviewerID": "AV1K4IVQVAZFK", "asin": "0005019281", "reviewerName": "Carol", "helpful": [0, 0], "reviewText": "Saw this movie many years ago, and checked for it to be on TV for several years, to no avail.  So happy to find this version.  Henry Winkler did a wonderful job.", "overall": 4.0, "summary": "Good movie", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
    {"reviewerID": "A3KBZ7NI16537Y", "asin": "0005019281", "reviewerName": "Carol T.", "helpful": [0, 0], "reviewText": "This has always been one of my favorites.I saw it when it first aired and was excited to see it again.", "overall": 5.0, "summary": "An American favorite.", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
    {"reviewerID": "A3VT62AP8KEK3V", "asin": "0005019281", "reviewerName": "Carolyn N.", "helpful": [1, 1], "reviewText": "Set in the USA about the time of the depression it is an update of that old familiar story of redemption.  The story is classic and this one is as good as all the rest.  Henry Winkler is good in this role.", "overall": 4.0, "summary": "It's a Christmas Carol", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A137B3F44TDVIX", "asin": "0005019281", "reviewerName": "Cat Sighs \"Never Say Never\"", "helpful": [3, 4], "reviewText": "This version of the classic \"A Christmas Carol\" is one of the best.Henry Winkler is brillant as Benedict Slade and in my opinion this is his most outstanding performance. I watched this movie when it was first released on TV during his Fonzie heyday, and I never once saw that 50's character. He is immersed in his character and is a completely convincing \"Scrooge.\"I'm disappointed that this isn't shown on TV, and I have purchased it so I can enjoy it again and again along with my husband and little girl.My top three \"A Christmas Carol\" versions star \"A Christmas Carol\" with Alistair Sim, \"Scrooge\" with Albert Finney, and \"An American Christmas Carol\" with Henry Winkler. I won't bother with the others.", "overall": 5.0, "summary": "One of the Best Scrooge versions", "unixReviewTime": 1164067200, "reviewTime": "11 21, 2006"}
    {"reviewerID": "AAM67Y93KTIOL", "asin": "0005019281", "reviewerName": "CFS", "helpful": [0, 0], "reviewText": "I really enjoy all the &#34;Christmas Carol-Scrooge&#34; movies. I own all the ones I know about and watch them each year. I want to add this one to my collection as it is a different take on the traditional ones.", "overall": 5.0, "summary": "A FAMILIAR CLASSIC IN A DIFFERENT WAY", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
    {"reviewerID": "A37UOTDP2USAK8", "asin": "0005019281", "reviewerName": "cftiffany", "helpful": [0, 0], "reviewText": "A good example of American history and an interesting interpretation of the Dicken's story. Well told, I enjoyed it immensely.", "overall": 4.0, "summary": "Whimsical warm movie", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A8RICSNM5RJLW", "asin": "0005019281", "reviewerName": "Chad Parlett", "helpful": [0, 0], "reviewText": "I always loved this version of a Christmas Carol. It's quite well done and original. A nice diversion from the standard fare. Winkler is wonderful.", "overall": 5.0, "summary": "The Fonz By Way of Dickens", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
    {"reviewerID": "A1GQF4JDJXBRLH", "asin": "0005019281", "reviewerName": "Charles A. Hickson \"Chas\"", "helpful": [0, 0], "reviewText": "This is a wonderful movie. It stay faithful to A Christmas Carol, but it very American. A fun movie for one and all.", "overall": 5.0, "summary": "Great Christmas movie for the family", "unixReviewTime": 1173312000, "reviewTime": "03 8, 2007"}
    {"reviewerID": "A13KAQO9F5X0FN", "asin": "0005019281", "reviewerName": "chaz", "helpful": [0, 0], "reviewText": "Anorher good movie for holiday watchers..a little twist from the ordinary scrooge movie. Enjoyable. What couldn't you like from the fons.", "overall": 4.0, "summary": "the fonz does scrooge", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
    {"reviewerID": "A3ECX7DUREGJ7G", "asin": "0005019281", "reviewerName": "Cheryl A. Zimmemann", "helpful": [2, 2], "reviewText": "This is my favorite rendition of the classic Dickens story \"A Christmas Carol.\"  Although the versions with George C. Scott and Patrick McNee are also very good, and I watch them at least once every holiday season, they emphasize the British and Victorian aspects of the story.  I am fond of \"An American Christmas Carol\" because it is set during the Depression and shows aspects of American society during that period.  The primary element missing from this version of the story is that Scrooge's sister and, hence, her son (Scrooge's nephew) are missing from this version, presumably in order to fit the original version within a specific time frame.  As a result the story element where the nephew's friends ridicule Scrooge's miserliness, and the corresponding redemptive element after the visitations are missing.  I felt that Henry Winkler performed the role of Scrooge admirably, even though he was only 34 at the time.  Usually the role is performed by an actor of mature years.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1168819200, "reviewTime": "01 15, 2007"}
    {"reviewerID": "A3UEOL981G9TXY", "asin": "0005019281", "reviewerName": "ChihuahuaMom", "helpful": [0, 0], "reviewText": "Henry Winkler played a great part as Scrooge.  It gave yet another twist to all the Christmas Carols of the past.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1328227200, "reviewTime": "02 3, 2012"}
    {"reviewerID": "AZBWH4HLG3JWV", "asin": "0005019281", "reviewerName": "Chris Crossont", "helpful": [0, 1], "reviewText": "Ignore some of the more negative reviews on here. This made for TV movie really touches me every time I watch it; which is every Christmas.The acting is splendid and the story is well written. It is suitable for the entire family and it gives a good picture of the depression era of our country.", "overall": 5.0, "summary": "One of my favorite Christmas movies!", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
    {"reviewerID": "A2219H7HY0F9V8", "asin": "0005019281", "reviewerName": "Christina England", "helpful": [0, 0], "reviewText": "We have been looking for this movie for over 15 years and were delighted to finally find it available on dvd!  Love love love it!", "overall": 5.0, "summary": "American Christmas Carol", "unixReviewTime": 1363046400, "reviewTime": "03 12, 2013"}
    {"reviewerID": "A1A9WDWEVC5AC0", "asin": "0005019281", "reviewerName": "christopher", "helpful": [9, 11], "reviewText": "First time i saw this movie was 1985 on television. Henry Winkler was excellent! Actually, the whole cast was great. I spent 17 years trying to locate this movie. You won't find it in a video store, at least where i live. And they don't show it on regular t.v. anymore. It is a MUST HAVE if you collect christmas movies.", "overall": 5.0, "summary": "A heart gripper", "unixReviewTime": 1036800000, "reviewTime": "11 9, 2002"}
    {"reviewerID": "A19THR3ZXSIK49", "asin": "0005019281", "reviewerName": "CJShopper", "helpful": [0, 0], "reviewText": "It's so funny to me that this was made at the height of Henry's Fonz days. It was surprisingly charming and brought me back to the days of my childhood Christmas TV shows.", "overall": 4.0, "summary": "The Fonz!", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A17DHMBDJMYVU1", "asin": "0005019281", "reviewerName": "Clayton Tschirn", "helpful": [0, 1], "reviewText": "Since I was a child many years past I have been interested in Dickens Christmas Carol. When I saw this version it stood out amoung the many other versions out there. Henry Winkler plays a good scrooge charactor. The story itself is based on Charles Dickens A Christmas Carol and the story sticks very close to the original with a 1920s depiction of the American depression.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1233273600, "reviewTime": "01 30, 2009"}
    {"reviewerID": "A2Q8O413HJZ55E", "asin": "0005019281", "reviewerName": "Clifford J. Carroll", "helpful": [0, 2], "reviewText": "We began watching this video, but stopped it a short way into it when we realized this was not what we had hoped for.  It was too contrived and predictable.", "overall": 2.0, "summary": "An American Christmas Carol", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
    {"reviewerID": "A2ZCGDI772NVQI", "asin": "0005019281", "reviewerName": "CLKindle", "helpful": [0, 0], "reviewText": "I wasn't expecting too much from this film, but was pleasantly surprised by the quality of the production and acting!  Henry Winkler (famous for playing &#34;the Fonz&#34; on Happy Days) proves his acting abilities and range of emotions in this satisfying film.  Some unexpected twists and just enough grit to make it evocative of Depression Era America make this a nice take on the Christmas classic.  (P.S.  Just wait for the Ghost of Christmas Future&#8230;so wouldn't think that would work out well, but it did!!!  That's all I'm saying. Love it.)", "overall": 5.0, "summary": "Interesting twist on a classic", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
    {"reviewerID": "A1L45FLKBI9K0H", "asin": "0005019281", "reviewerName": "Cody", "helpful": [0, 0], "reviewText": "This movie was made in 1979, when Henry Winkler was in his heyday of playing \"The Fonz\" on \"Happy Days\".  It was exciting back then to see what else he could do, and he came through admirably.This movie hasn't played on TV in at least a decade that I remember, and it should be, for it's a fresh take on the old Dickens tale.The setting is Concord, NH in 1933, and miserly Benedict Slade goes about repossessing people's furniture, stoves, radios - and even a piano from a children's orphanage! - on Christmas Eve.Then come the visitations and, well, we know the rest of the story.Pick it up for a treat for next Christmas.", "overall": 4.0, "summary": "Wonderful Variation of an Old Classic", "unixReviewTime": 1198627200, "reviewTime": "12 26, 2007"}
    {"reviewerID": "A26UI3EHSMSHG6", "asin": "0005019281", "reviewerName": "Connie L. Williams", "helpful": [0, 0], "reviewText": "Enjoyed watching this,I have looked for years for the Henry Winkler verson.Got it very fast.Great quality,much better than vhs.", "overall": 4.0, "summary": "Classic", "unixReviewTime": 1217635200, "reviewTime": "08 2, 2008"}
    {"reviewerID": "A23AE7RQKN9ZPQ", "asin": "0005019281", "reviewerName": "Corinne L Cherryholmes", "helpful": [0, 0], "reviewText": "Great twist on the original Christmas Carol. I have always enjoyed this one and it is never seen on television anymore.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1331424000, "reviewTime": "03 11, 2012"}
    {"reviewerID": "A3QNGMNQW59UT0", "asin": "0005019281", "reviewerName": "craigbic", "helpful": [0, 0], "reviewText": "I last watched this movie sometime back in the 80's when it used to be on regularly around Christmas time on TV. I loved this movie as it was an interesting and engaging alternative to the more common Scott and Finney versions of the classic Christmas Carol that always got the most airtime. It depicts depression era New England with a cold, grey feeling that really comes across the screen without bogging the movie down and having grown up in Boston, it makes it that much more intersting to me. The acting is top-notch, particularly from Henry Winkler. It was always one of my favorite Christmas specials. Then it went off the air never to return sometime back then (80's, 90's, I'm not sure exactly when) and I never forgot about it and often pined to watch it again but somehow always seemed to forget to look for it on VHS, DVD, or online. I stumbled onto it on Amazon via my Roku box and was delighted to see it again and purchased it so I can once again enjoy this teriffic movie with my kids! Any fan of A Christmas Carol (or just really good Christmas movies) should immediately get this movie in their collection!", "overall": 5.0, "summary": "A must have for holiday film fans!", "unixReviewTime": 1323216000, "reviewTime": "12 7, 2011"}
    {"reviewerID": "A1J6M0V9F51U9C", "asin": "0005019281", "reviewerName": "Craig Perry", "helpful": [0, 0], "reviewText": "I received the DVD within days; it was exactly what I wanted. It was a gift for my father for Christmas, we watched the DVD together as a family. Billing was easy, shipping was earlier than expected and product was exactly what I wanted.", "overall": 5.0, "summary": "DVD Purchase", "unixReviewTime": 1326067200, "reviewTime": "01 9, 2012"}
    {"reviewerID": "A13W8CA4PHWBDA", "asin": "0005019281", "reviewerName": "C.R. Barclay", "helpful": [0, 0], "reviewText": "My wife and I loved seeing this movie.  Both of us have childhood memories of this movie and it was great to curl up on the couch and watch.", "overall": 5.0, "summary": "Great Holiday movie", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
    {"reviewerID": "A3VM88280S09LH", "asin": "0005019281", "reviewerName": "Cyndee", "helpful": [0, 0], "reviewText": "My husband and I have a Christmas movie collection which includes about 20 different versions of The Christmas Carol.  I wasn't expecting much from this but was delightfully surprised.  It was a very different yet wonderful rendition.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1362355200, "reviewTime": "03 4, 2013"}
    {"reviewerID": "A38IHZTC22PHEH", "asin": "0005019281", "reviewerName": "Dan", "helpful": [0, 0], "reviewText": "It seems like just about everybody has made a Christmas Carol movie.  This one is the best by far!  It seems more realistic than all the others and the time period seems to be perfect.  The acting is also far better than any of the others I've seen; my opinion.", "overall": 5.0, "summary": "The best \"Christmas Carol\" story", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
    {"reviewerID": "A1PXS5N63PS6WR", "asin": "0005019281", "reviewerName": "Dan Willis \"Author\"", "helpful": [2, 3], "reviewText": "I must confess to being a bit of a coinsure of Dickens' classic tale.  I have many versions of it and always love seeing the various interpretations offered.  This one, however, continues to be one of my all time favorites.  The change of setting forces the film to explain elements of the book that most films overlook because they assume you're already familiar with the story.  Examples of this include how Scrooge (Slade in the film) could be so mean and yet think himself a just man, also the reason the ghost of his dead partner is miserable (not understanding the need to do good until he has lost the power).  Add to this the wonderful performances by Winkler et al and you've got an absolutely classic film.In my opinion, this version of Dickens' story is closer to the original spirit of his work than many less derivative versions.  The material is handled with reverence and respect and it shows, the settings and characters are well conceived, and the look of the film is faithful to the period.  All in  all an excellent holiday piece well worth the money.", "overall": 5.0, "summary": "Change can be good", "unixReviewTime": 1008115200, "reviewTime": "12 12, 2001"}
    {"reviewerID": "A27BF3YQB9N8AH", "asin": "0005019281", "reviewerName": "Darth Rater", "helpful": [0, 0], "reviewText": "This is Charles Dickens' classic Christmas Carol with an American twist.  This version does a nice job of capturing the consequences of history and one's personal role in it.  It provides a sobering view of the main character's choices, just as the original, &#34;A Christmas Carol,&#34; did but this version also shows how one man's choices affect those around him.  I recommend this film to anyone who collects different versions of, &#34;A Christmas Carol.&#34;", "overall": 5.0, "summary": "A Worthy Version of A Christmas Carol", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
    {"reviewerID": "A3N2P6WJW54TH2", "asin": "0005019281", "reviewerName": "David Brunell", "helpful": [0, 0], "reviewText": "I thought that this movie was great it had a different twist on the classic, I would watch this movie again", "overall": 5.0, "summary": "full circle", "unixReviewTime": 1387324800, "reviewTime": "12 18, 2013"}
    {"reviewerID": "ASJN2D3N3VWFN", "asin": "0005019281", "reviewerName": "David C. Lewis", "helpful": [0, 0], "reviewText": "This is an excellent remake of the Dickins' A Christmas Carol.  It should be placed along side your existing Christmas collection!", "overall": 5.0, "summary": "Movie Remake", "unixReviewTime": 1208649600, "reviewTime": "04 20, 2008"}
    {"reviewerID": "A1FIPOMYT9W4FS", "asin": "0005019281", "reviewerName": "David G. \"David\"", "helpful": [0, 0], "reviewText": "I can't believe how long it took &#34;them&#34; to get this wonderful Christmas show on DVD. It's a modern (1930s America) twist on Charles Dickens' classic tale. Winkler makes me hate his character as much as Alister Sim did in his portrayal of Scrooge in the 1951 production. Certainly one for your visual library.", "overall": 5.0, "summary": "It's about time...", "unixReviewTime": 1363910400, "reviewTime": "03 22, 2013"}
    {"reviewerID": "A24SQMM6M0QBK2", "asin": "0005019281", "reviewerName": "David M. Cunningham", "helpful": [0, 0], "reviewText": "A classic tale which has not been regularly shown on TV for years. This is one of the all time greats and Henry Winkler's performance is outstanding.  Highly recommended!", "overall": 5.0, "summary": "An American Christmas Carol (DVD)", "unixReviewTime": 1323734400, "reviewTime": "12 13, 2011"}
    {"reviewerID": "A2KJ92GG58CZNR", "asin": "0005019281", "reviewerName": "David M.", "helpful": [0, 0], "reviewText": "Fantastic American twist of the classic &#34;A Christmas Carol&#34;. It brings things closer to home with all the essence of the original classic", "overall": 5.0, "summary": "Henry Winkler at his best.", "unixReviewTime": 1389312000, "reviewTime": "01 10, 2014"}
    {"reviewerID": "A3JDW8YT5N55Y7", "asin": "0005019281", "reviewerName": "dawn stinson", "helpful": [1, 2], "reviewText": "i thought that actor dorian harewood was fantastic in this role.", "overall": 5.0, "summary": "the ghost of xmas future", "unixReviewTime": 978220800, "reviewTime": "12 31, 2000"}
    {"reviewerID": "A37MUTK4S86BCF", "asin": "0005019281", "reviewerName": "DCchicago", "helpful": [0, 0], "reviewText": "This is a novel and entertaining take on the Dicken's classic.  The &#34;Fonz&#34; gives an admirable performance.  I will watch again.", "overall": 3.0, "summary": "American Take on Christmas Classic", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A126Q2HVTCS9P2", "asin": "0005019281", "reviewerName": "D. Duggan \"IT Specialist\"", "helpful": [0, 0], "reviewText": "Henry Winkler is a fine actor and this version of the famous story is proof positive. He does and excellent job as Ebeneezer Scrooge. The story, of course, is the same as the other versions, but each remake brings a different interpretation by the actors and writers. This one is fun and easy to watch. A fine family film.", "overall": 5.0, "summary": "Fonzie as Scrooge", "unixReviewTime": 1393545600, "reviewTime": "02 28, 2014"}
    {"reviewerID": "A33GLEGEVV4QI0", "asin": "0005019281", "reviewerName": "debby", "helpful": [0, 0], "reviewText": "haven't been able to find this out in the world.  i really like this version and want to share it with my girls. found it here, yay!!!!!!!", "overall": 5.0, "summary": "not out there", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
    {"reviewerID": "A3B261Q5JFSK6Y", "asin": "0005019281", "reviewerName": "Debra L. Lucas \"sk8rmommy\"", "helpful": [0, 0], "reviewText": "This timeless story is relevant to today's economic times. This movie is as valuable as any modern-day teachings I've read within the context of \"how to be a better person, live well, and do it right in the new year\". There are old fashion morals that America would do well in revisiting. Kids and young adults alike will find a new perspective on everyday life challenges. Everyone will gain a better attitude after viewing this one.Anyone who purchases this movie will not be disappointed.Henry Winkler; who doesn't enjoy his workmanship?", "overall": 5.0, "summary": "An instant favorite", "unixReviewTime": 1389571200, "reviewTime": "01 13, 2014"}
    {"reviewerID": "A2QXBBR326NW0X", "asin": "0005019281", "reviewerName": "Dennis Carlson", "helpful": [0, 0], "reviewText": "A brilliant adaptation of Dickson's classic set in early 20th century New England.  Well written and well acted, Henry Winkler shines as a young entrepreneur who is more interested in wealth and progress than romance and family, until...  I don't want to give it away.  Trust me. You'll love it.", "overall": 4.0, "summary": "Brilliant Adaptation", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
    {"reviewerID": "A3PISDFRIWEJA9", "asin": "0005019281", "reviewerName": "DEP", "helpful": [0, 0], "reviewText": "This particular version offered a different view of the classic tale and was well worth watching.  Merry Christmas and Happy New Year.", "overall": 4.0, "summary": "Worth watching", "unixReviewTime": 1388880000, "reviewTime": "01 5, 2014"}
    {"reviewerID": "A24XT4V09ZONSF", "asin": "0005019281", "reviewerName": "Desert Bill \"Desert Bill\"", "helpful": [0, 0], "reviewText": "I don't think any movie will be as good as the Alastair Sims version. But this one, which takes place during the depression, is nevertheless excellent. Henry Winkler is an excellent, more modern Mr. Scrooge.", "overall": 5.0, "summary": "Nice, different version", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
    {"reviewerID": "A2PNKBQJQT7RS8", "asin": "0005019281", "reviewerName": "devon talbot", "helpful": [0, 0], "reviewText": "A great acting job by Henry Winkler. I saw this many years ago and it'll always be a Christmas favorite.", "overall": 5.0, "summary": "Henry Winkler as a modern-day Scrooge", "unixReviewTime": 1385596800, "reviewTime": "11 28, 2013"}
    {"reviewerID": "A2LMVHZV1MITHO", "asin": "0005019281", "reviewerName": "Diane O Lawhorn", "helpful": [0, 0], "reviewText": "Wasn't my favorite version but I still enjoyed it.  I didn't particularly care for Henry Winkler makeup . Wasn't very real looking.", "overall": 3.0, "summary": "enjoyed this version", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
    {"reviewerID": "AVWWFK3FZDEL2", "asin": "0005019281", "reviewerName": "D. Mckinzie", "helpful": [7, 9], "reviewText": "Henry Winkler stars in this remake of the classic tale of Scrooge.  This one is set in post-Depression era America and is oneof the best I've ever seen.  Winkler is equally at ease as a young man with a girlfriend or an old man with an attitude.  I watch this every Christmas and was delighted to discover it on DVD.  You'll love it!", "overall": 5.0, "summary": "Another Great Christmas Classic", "unixReviewTime": 1059004800, "reviewTime": "07 24, 2003"}
    {"reviewerID": "A2E27PODYFZBGC", "asin": "0005019281", "reviewerName": "Donna", "helpful": [0, 0], "reviewText": "The title says it all - this is a Christmas carol re-done. Henery Winkler play the part of Scrooge in this American version of the timeless Classic It is well worth the investment if you are a collector of the Christmas carol stories.", "overall": 4.0, "summary": "Christmas carol redone", "unixReviewTime": 1275177600, "reviewTime": "05 30, 2010"}
    {"reviewerID": "AKOE75QZDY7A4", "asin": "0005019281", "reviewerName": "Donna Laverdiere", "helpful": [0, 0], "reviewText": "Henry Winkler does an amazing job as scrooge in this tale, he is an awesome actor, I really like sitting down to watch this movie on a cold night.", "overall": 5.0, "summary": "Christmas Scrooge", "unixReviewTime": 1260576000, "reviewTime": "12 12, 2009"}
    {"reviewerID": "A1BWR0XSODEIJL", "asin": "0005019281", "reviewerName": "DOROTHY HART", "helpful": [0, 0], "reviewText": "Typical made for TV movie, Can't say that Henry Winkler was one of the best Scrooges we have seen, but enjoyed it. We are collecting all versions of this film that we can find.", "overall": 3.0, "summary": "twist on an old classic", "unixReviewTime": 1357603200, "reviewTime": "01 8, 2013"}
    {"reviewerID": "A33KS5S68111VY", "asin": "0005019281", "reviewerName": "dosmith", "helpful": [0, 0], "reviewText": "An updated version of A Christmas Carol that doesn't lose any of the important stuff. Great movie for the family.", "overall": 4.0, "summary": "New take on an old tale", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A34BWIRIDNHWLG", "asin": "0005019281", "reviewerName": "Earl", "helpful": [0, 0], "reviewText": "This is a great version of the old classic. It stays with the original storyline and Henry Winkler does his usual outstanding performance. A definite movie to watch over again next Christmas season.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1388880000, "reviewTime": "01 5, 2014"}
    {"reviewerID": "A10O6QLKFO3R6R", "asin": "0005019281", "reviewerName": "easyreader50", "helpful": [0, 0], "reviewText": "Most of us remember Henry Winkler in the role of Arthur \"The Fonz\" Fonzarelli on Happy Days. I took a chance on this. He's an even better actor than I remember. The story is set during the depression. Henry's character reposesses furniture rented from him by various poor families. Instead of ghosts, he has visions involving the people he's left destitute. Not sappy like some Christmas Carol renditions are. I was favorably impressed by the story as well as the acting. Gerard Parks (Doc from Fraggle Rock) was also in it, as was a young Dorian Harewood. A nice addition to my Christmas Carol collection.", "overall": 5.0, "summary": "Another side of Henry", "unixReviewTime": 1300752000, "reviewTime": "03 22, 2011"}
    {"reviewerID": "AR4O6ZVN45NJM", "asin": "0005019281", "reviewerName": "Edward Tregoe", "helpful": [0, 0], "reviewText": "Great movie. I wish you would include more of the old TV Christmas shows for purchase. Excellent quality of viewing and pleasant movie.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A2D4HRAA7E0FRQ", "asin": "0005019281", "reviewerName": "Edwin Jackson", "helpful": [2, 4], "reviewText": "Henry Winkler is excellent. The only thing I have to say is, there was too much time spent on his Christmas past. I got bored with it. Otherwise, it was good and worth the money.", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1248912000, "reviewTime": "07 30, 2009"}
    {"reviewerID": "A26OBZKMR6VK45", "asin": "0005019281", "reviewerName": "E. Kostas \"Mr.Movie Buff\"", "helpful": [0, 0], "reviewText": "It is on the same basis as other Christmas Carol movies, just played a little differently and with Henry Winkler as the scrooge.  We enjoyed it. Now we have it and can bring it out each Christmas.  Aside from the review I wanted to say I had ordered the item late and figured I would not get it until after Christmas, but it was shipped out standard and I received it in a very few days.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1265414400, "reviewTime": "02 6, 2010"}
    {"reviewerID": "A100Z2S0880G9A", "asin": "0005019281", "reviewerName": "Eric J. Oconnor", "helpful": [0, 0], "reviewText": "I really enjoy this movie.  Its a Christmas Carol slightly reworked and looks like a television production.  I think Winkler does a good job covering all the age changes required.  I have it on my list of 5 or 6 must see DVDs every Christmas Season.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1199577600, "reviewTime": "01 6, 2008"}
    {"reviewerID": "AZB4CQ9JZSUQB", "asin": "0005019281", "reviewerName": "Eric Pregosin", "helpful": [3, 4], "reviewText": "When this first aired in 1979, I enjoyed it so much I clean forgot it was &quot;A Christmas Carol&quot;.  I wanted to see it over and over again thoughout the year.  When I finally got a copy on VHS, I got that wish.  Now I finally got the DVD copy and am I glad.  To see Henry Winkler as the best Scrooge or variation on him since Alistair Sim in the 1951 version now on DVD is a treat for the gods.  Although I have both the 1984 and 1999 made for television films made with George Scott and Patrick Stewart on DVD, this version was the first attempt to bring the classic Dickens tale to the small screen. It is as just as enjoyable today as it was 20 plus years ago, and this way it will live forever.  Get it now and on disc before it gets away.", "overall": 5.0, "summary": "A Christmas Carol to be remembered", "unixReviewTime": 1012176000, "reviewTime": "01 28, 2002"}
    {"reviewerID": "A1QP8CVESJ1FP7", "asin": "0005019281", "reviewerName": "eva menza", "helpful": [0, 0], "reviewText": "Best Christmas movie ever I'm glad they released it on DVD been looking for along time and now I have it thanks", "overall": 5.0, "summary": "Movie", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}
    {"reviewerID": "A2JYJO88HFRU1I", "asin": "0005019281", "reviewerName": "Firedoc", "helpful": [0, 0], "reviewText": "Reproduction is first rate. Limited extras but interesting. I think the original production was on par with other TV movies of the time. The adaption of A Christmas Carol to a Depression era setting was well done. Henry Winkler is excellent in portraying the bitter  old man. If you have a Christmas DVD collection, like me, this belongs in it.", "overall": 4.0, "summary": "Watch every Christmas", "unixReviewTime": 1359849600, "reviewTime": "02 3, 2013"}
    {"reviewerID": "A3KGAJ86I4T73J", "asin": "0005019281", "reviewerName": "FrankLVN \"FrankLVN\"", "helpful": [0, 0], "reviewText": "The Christmas Carol is my all-time favorite movie, and I had ever version imagionable on VHS, including this adaptation, but the remarkably enhanced quality of the DVD version is extremely enjoyable to watch. This rendition gives it an American twist, as Henry Winkler did a wonderful performance of a modern-day Scrooge.", "overall": 5.0, "summary": "AN ENJOYABLE TWIST", "unixReviewTime": 1229731200, "reviewTime": "12 20, 2008"}
    {"reviewerID": "A1FWW47TZ65PNY", "asin": "0005019281", "reviewerName": "FrankPar", "helpful": [0, 0], "reviewText": "I enjoyed this TV production the first time I saw it in 1979 or 1980 and really enjoyed it this time.  It is obvious that it is a TV production but most of the acting is good and the story set in the depression is good.  I am very happy it was still available.", "overall": 5.0, "summary": "A unique twist on a Christmas classic", "unixReviewTime": 1325462400, "reviewTime": "01 2, 2012"}
    {"reviewerID": "A26IQ9W0XF9KIE", "asin": "0005019281", "reviewerName": "Frederick T. Aldrich \"Fred\"", "helpful": [1, 1], "reviewText": "Loved the movie with Henry Winkler, that aired on TV quite a few years ago.  We always waited every Holiday Season for it to be re-aired, but never saw it again.  It was great finding it on Amazon, and really enjoyed watching this charming movie again.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1168300800, "reviewTime": "01 9, 2007"}
    {"reviewerID": "A2VSOXAOR2QBVG", "asin": "0005019281", "reviewerName": "frieda revels", "helpful": [0, 0], "reviewText": "HENRY WINKLER DOES A GOOD JOB PUTTING AN AMERICAN SPIN ON SCROOGE. I NEVER THOUGHT FONZE COULD PULL IT OFF BUT HE DID A FINE JOB.  MAYBE NOT ACADEMY AWARD MATERIAL BUT VERY ENJOYABLE.", "overall": 4.0, "summary": "HENRY WINKLER DOES GREAT", "unixReviewTime": 1392163200, "reviewTime": "02 12, 2014"}
    {"reviewerID": "A22GJ2SRENMZS0", "asin": "0005019281", "reviewerName": "F. Sisti \"ftt meditator\"", "helpful": [0, 0], "reviewText": "Winkler does a little over-the-top in his role as the scrooge character and the production values leave somewhat more to be desired but all-in-all a nice rendition for holiday viewing.", "overall": 4.0, "summary": "Dated TV Flic", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
    {"reviewerID": "ALVW4TQYL6729", "asin": "0005019281", "reviewerName": "Gary Brennan", "helpful": [0, 0], "reviewText": "The whole story does not develop well. No big set up of a grouchy Scrooge character. No big transformation. Weak all around.", "overall": 3.0, "summary": "It's just OK", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
    {"reviewerID": "A2I0X9N2RH7R7X", "asin": "0005019281", "reviewerName": "gary Snead", "helpful": [0, 0], "reviewText": "It is a different take, but the message remains the same. Winkler does a surprisingly good job! I recommend it!", "overall": 4.0, "summary": "A New Slant On An Old Tale", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
    {"reviewerID": "AQIYZW55ENZYU", "asin": "0005019281", "reviewerName": "G. Bradford", "helpful": [1, 1], "reviewText": "\"An American Christmas Carol\" is a quintessential version of Dickens' classic tale set during the depression.  I view it every year.  Henry Winkler does a wonderful job of the \"Scrooge\" character and his supporting cast does equally well.  It should be consider a classic film and is definitely one of the best versions of \"A Christmas Carol\".", "overall": 5.0, "summary": "A Quintessential Telling....", "unixReviewTime": 1267142400, "reviewTime": "02 26, 2010"}
    {"reviewerID": "A26NRTM9VWR94O", "asin": "0005019281", "reviewerName": "G. E.", "helpful": [0, 0], "reviewText": "Blu-ray disc is digitally remastered and is 1080p however the format is &#34;1.33:1&#34;!!! It is after all a made for TV movie. Sorry but you expect &#34;1.85:1&#34;  on Blu-ray. None of the other reviews or descriptions advise you of the format.Had I known this I would not have ordered it on Blu-ray. I did and it's not that important to return it within the 30 days as it does add to my Scrooge collection.I will not prattle on about A Christmas Carol. Three ghosts transforming a curmudgeon on Christmas Eve. You love or hate it, Enough said!", "overall": 3.0, "summary": "Blu-ray review! be aware of the format before you order..", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
    {"reviewerID": "A1M4W5ZUKL7QT7", "asin": "0005019281", "reviewerName": "Glen M. Danielsen", "helpful": [1, 1], "reviewText": "Henry Winkler makes this delightfull Dickens variant a treasure of its own.  (In Blu Ray now - yes!)  This great actor has always been a welcome see.", "overall": 5.0, "summary": "Not Merely an American Spin-off", "unixReviewTime": 1382572800, "reviewTime": "10 24, 2013"}
    {"reviewerID": "AEAJWQNTW235T", "asin": "0005019281", "reviewerName": "gloria keith", "helpful": [0, 0], "reviewText": "I love this movie and was happy to find it on dvd. I would recommend this movie to anyone who likes a good christmas movie.", "overall": 4.0, "summary": "Great movie", "unixReviewTime": 1371081600, "reviewTime": "06 13, 2013"}
    {"reviewerID": "A258ONALWRQMV1", "asin": "0005019281", "reviewerName": "Gregory C. Thibeau", "helpful": [0, 0], "reviewText": "This is a timeless classic which shows that those people from the Depression era experienced a lot of what might have taken place in England during the time of Dickens.", "overall": 5.0, "summary": "A classic", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
    {"reviewerID": "AQPESGTO73D0T", "asin": "0005019281", "reviewerName": "Grumpy", "helpful": [0, 0], "reviewText": "I liked Mr Winklers pertrayal of a depression error Ebineser. He played the part of promising, driven young man, to unmoraled business man, to kind hearted senior citizen quite well. It was not a big Holywood production. But for a made for TV Movie it was quite good.", "overall": 4.0, "summary": "Good job Henry", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
    {"reviewerID": "AJCZMHX3H9Q9V", "asin": "0005019281", "reviewerName": "gunslinger", "helpful": [0, 0], "reviewText": "I first saw this adaptation during its initial run on television, and for a while it made an appearance during the Christmas season, but it is no longer seen. The opening scenes where Winkler, as Benedict Slade, is going around on Christmas eve repossessing a farmer's stove and the piano from the orphanage tells sets the stage perfectly and what follows is a delightful, well acted and produced, American version of the original. I had it on VHS for a while, until the tape became old and unusable, and now have it on DVD. Anyone who buys it will not be disappointed.", "overall": 5.0, "summary": "Perhaps the best", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
    {"reviewerID": "A2FQODF76KU7VD", "asin": "0005019281", "reviewerName": "harv", "helpful": [0, 0], "reviewText": "This is hardly ever on TV and thankfully found on Prime. This movie captures the 30's as well as Dickens' Christmas Carol", "overall": 5.0, "summary": "An American Classic", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
    {"reviewerID": "A18LQQ6KUK9IF6", "asin": "0005019281", "reviewerName": "HB1967", "helpful": [0, 0], "reviewText": "Not the best acting. The story is a classic so I watched it. The 1951 A Christmas Carol version with Alastair Sims is the best. Or the George C Scott one isn't bad either.", "overall": 3.0, "summary": "Great story not the best acting.", "unixReviewTime": 1387324800, "reviewTime": "12 18, 2013"}
    {"reviewerID": "A2QABS4AEMS2BN", "asin": "0005019281", "reviewerName": "Heatherbell65", "helpful": [0, 0], "reviewText": "I was so thankful to come across this dvd. For some reason during the Christmas season they never show this movie on any of the numerous cable stations anyore. I haven't seen this movie on tv since the 1980's and I don't understand why, it is such a good movie and Henry Winkler's performance is terrific. I believe Happy Days was still on tv at this time albiet it was probably during the end of the series. The only place to find this movie was through Amazon just as they don't play it on tv you can't find the dvd in the stores either so the ability to find this movie was almost impossible except thankfully through Amazon. I would never pay as much for a dvd as I did for this one but it is one of my husbands favorite Christmas movies so it had a special meaning to surprise him with this as a gift, so thank you.", "overall": 5.0, "summary": "Finally found this movie!!", "unixReviewTime": 1327363200, "reviewTime": "01 24, 2012"}
    {"reviewerID": "A3MPY30523TAVT", "asin": "0005019281", "reviewerName": "Heather", "helpful": [2, 2], "reviewText": "Take A Christmas Carol and place it in the middle of the great depression and you have this movie. For me I like this version because it explains more of the back story for the Scrooge character. I also like in the end that despite having his change of heart he is still very much himself. In stead of all of the sudden being great with kids and more at ease in social settings, he is still somewhat uncomfortable in these situations. For me it was a little more realistic. Henry Winkler did a great job as this character and I loved the interview with him as he described how he became &#34;Scrooge&#34;.", "overall": 5.0, "summary": "An American twist to a classic", "unixReviewTime": 1354060800, "reviewTime": "11 28, 2012"}
    {"reviewerID": "A1U3G5C5JX3Y6B", "asin": "0005019281", "reviewerName": "Henry J. Ogonowski Jr.", "helpful": [0, 0], "reviewText": "I have always loved this rendition of A Christmas Carol with it's american twist.  I had it on VHS but finally gave up my player for a DVD player.Previously only bootlegged copies were available.  I was very happy to find it recently produced on DVD/Bluray.It is a great Holiday movie.", "overall": 5.0, "summary": "Glad it's finally out on DVD/Bluray", "unixReviewTime": 1359504000, "reviewTime": "01 30, 2013"}
    {"reviewerID": "ALLFFX35KDAQ4", "asin": "0005019281", "reviewerName": "Herbert Davis", "helpful": [0, 0], "reviewText": "I truely feel, this is the best version of Christmas Carol ever made. Henry Winkler did a great justice to this movie.", "overall": 5.0, "summary": "great movie", "unixReviewTime": 1384387200, "reviewTime": "11 14, 2013"}
    {"reviewerID": "AJLAJCO6GTFWN", "asin": "0005019281", "reviewerName": "H. Martell \"HM\"", "helpful": [0, 0], "reviewText": "He did a great job as a Scrooge type character. I truly enjoyed this film. I liked him from the Happy Days show.", "overall": 5.0, "summary": "love Henry Winkler", "unixReviewTime": 1357603200, "reviewTime": "01 8, 2013"}
    {"reviewerID": "A1ZAQHMCCT297C", "asin": "0005019281", "reviewerName": "Holly Anne Romanoli", "helpful": [0, 0], "reviewText": "This has not been on TV, that I know of in many years but really great performance by Henry Winkler. Thank you.", "overall": 5.0, "summary": "So happy I was able to get this", "unixReviewTime": 1355443200, "reviewTime": "12 14, 2012"}
    {"reviewerID": "A22G01AXB3H5TY", "asin": "0005019281", "reviewerName": "Honey Bee", "helpful": [1, 1], "reviewText": "this is my favorite twist on the orginal christmas carol.if you collect and enjoy different versions of this story this is a must have. henry winkler is fantastic, and the character transformation from a crabbie tight wad to a friendly giving man was very convincing . in the end his way of \"paying it forward\" added a new ending to an old classic.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1236988800, "reviewTime": "03 14, 2009"}
    {"reviewerID": "A1DUK6J2EOD0DP", "asin": "0005019281", "reviewerName": "Howard G. Bowen", "helpful": [0, 0], "reviewText": "I thought that I would never find this dvd, but they had. It was just what I was looking for. Thanks so much.", "overall": 5.0, "summary": "I loved it.", "unixReviewTime": 1359936000, "reviewTime": "02 4, 2013"}
    {"reviewerID": "AT82PUPRMA07B", "asin": "0005019281", "reviewerName": "Interview", "helpful": [0, 0], "reviewText": "Henry Winkler does a great job in this production that gives an American slant to the famous &#34;A Christmas Carol.&#34;  He portrays a ruthless and emtionless business man and how he repossesses people's beloved items on which they can no longer make payments.  He is so sure he is right in these endeavors, and he has a basement full of his collections to prove how he can outwit others and survive.  I saw this movie on TV over 15 years ago, but have never been able to find it on DVD.  It is now available on DVD, and I highly recommend this movie.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1355788800, "reviewTime": "12 18, 2012"}
    {"reviewerID": "AVECJZDR0LYZN", "asin": "0005019281", "reviewerName": "irish eyes", "helpful": [0, 0], "reviewText": "This was one of my favorite holiday movies as a kid.  Although it is tailored after Charles Dickens &#8220;Christmas Carol&#8221;, this movie has some distinct differences which actually make it stand on its own merit.  I love the regular story of Christmas Carol, but this is refreshingly different and a must see.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1392336000, "reviewTime": "02 14, 2014"}
    {"reviewerID": "A1K34FVJ2AJI2W", "asin": "0005019281", "reviewerName": "IT NUT", "helpful": [0, 0], "reviewText": "Henry Winkler did a wonderful acting job as Benedict Slade. I first saw this movie online recently and wonder how I missed never seeing it on TV. And not just his acting but it seemed all actors did a great job in this American version of Scrooge. After seeing it online I ordered it right away to add to our Christmas collection. If you haven't seen it I believe you will be pleasantly surprised. If you enjoy other adaptations of Scrooge you will certainly enjoy this movie.If you would like to read more or order the dvd click this link. I've added it for your convenience, not persuaded by the seller.[...]", "overall": 5.0, "summary": "An Excellent American Version", "unixReviewTime": 1311033600, "reviewTime": "07 19, 2011"}
    {"reviewerID": "A2POKTUSVTGWU0", "asin": "0005019281", "reviewerName": "Izdateacher", "helpful": [0, 0], "reviewText": "this movie stars henry winkler. an enjoyable christmas tale. he was superb in this role. a twist on the old &#34;scrooge&#34;.", "overall": 4.0, "summary": "an american christmas carol", "unixReviewTime": 1373673600, "reviewTime": "07 13, 2013"}
    {"reviewerID": "A3L3ORBU5IXTMX", "asin": "0005019281", "reviewerName": "Jacquelin L. Morris", "helpful": [0, 0], "reviewText": "I got this for a person who has it on vhs and needed it replaced. They wanted to keep it in there collection. Thank you for the promptness of receiving it.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
    {"reviewerID": "AG4FMYITPTATN", "asin": "0005019281", "reviewerName": "J. A. Knott \"DVD enthusiast\"", "helpful": [1, 10], "reviewText": "I thought I remembered this film as a good one from television many years ago but I had obviously forgotten it completely. It's poor quality film, dated and badly written. Henry Winkler's make up is just awful. I couldn't watch it through to the end. I collect Christmas Carol films  but this one that will never go in the dvd player again!", "overall": 1.0, "summary": "Not this Christmas Carol", "unixReviewTime": 1260921600, "reviewTime": "12 16, 2009"}
    {"reviewerID": "A3OBYFTSJ72YUY", "asin": "0005019281", "reviewerName": "James Cook", "helpful": [0, 0], "reviewText": "I like to think that I have a great collection of all the video versions of this story.  Had to have this one to keep current.  Predictable story, interesting ghosts, and a stellar performance by Winkler.", "overall": 4.0, "summary": "One more in the bag...", "unixReviewTime": 1355788800, "reviewTime": "12 18, 2012"}
    {"reviewerID": "A1L2YX5DOO1WXM", "asin": "0005019281", "reviewerName": "James M. Lynn", "helpful": [0, 0], "reviewText": "Good made for TV movie.  The makeup on Henry Winkler is not too good. Good interpretation of an old story.", "overall": 3.0, "summary": "TV movie", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
    {"reviewerID": "A17FS08RHAEU43", "asin": "0005019281", "reviewerName": "James Or Paula Surber", "helpful": [0, 0], "reviewText": "This is a great movie.  I purchased it for my kindle fire and watched it and it still is a movie I love.  It was clear and the sound was great.  I can not stress enough how clear this is and how words can not express enough of how this movie is.  I will be getting more HD movies for the kindle fire.  Great for traveling for me.", "overall": 5.0, "summary": "Favorite", "unixReviewTime": 1355961600, "reviewTime": "12 20, 2012"}
    {"reviewerID": "A12445WD4TJHUK", "asin": "0005019281", "reviewerName": "Jan Galkowski \"Jan Galkowski\"", "helpful": [0, 0], "reviewText": "Trying to make Dickens relevant again, this dresses him up in American hard times and values. Winkler is always a pleasure to watch. I don't know, however, how Winkler would have Dickens speak if set in post-2007 American, though.", "overall": 4.0, "summary": "Nicely done re-placement of Dicken's classic in an American setting", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A18RU8H09GLAFD", "asin": "0005019281", "reviewerName": "Jared Tessier \"bizee mom\"", "helpful": [0, 0], "reviewText": "Our family loves the modern tones to this classic story.  Henry Winkler is a joy to watch and each character plays their part perfectly.  I watched this as a little girl, and now my children are enjoying it as well. As the story unfolds I find myself furious with Slade, compassionate toward him and then in the end celebrating with him as he decides to take his new found joy and help someone else...we just love it!", "overall": 5.0, "summary": "great holiday classic!", "unixReviewTime": 1198972800, "reviewTime": "12 30, 2007"}
    {"reviewerID": "A3B5N9IMLURIYA", "asin": "0005019281", "reviewerName": "Jay L Henson", "helpful": [0, 0], "reviewText": "Been looking for this movie for a long time. It is a good twist on a classic novel. Besides it is Fonzy!", "overall": 4.0, "summary": "Love This", "unixReviewTime": 1367625600, "reviewTime": "05 4, 2013"}
    {"reviewerID": "A4CAZ91RSWUJT", "asin": "0005019281", "reviewerName": "J. Clewell \"DVD addict\"", "helpful": [0, 0], "reviewText": "This was an interesting twist on the English version.  Love Henry Winkler!  No Bah Humbug here!  An enjoyable family film.", "overall": 3.0, "summary": "Good show!", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A29NAVZMCE2TY4", "asin": "0005019281", "reviewerName": "J. Depalma \"Jimmy D\"", "helpful": [1, 8], "reviewText": "Dickens writing is poetry of the highest order, and as a story teller he has few peers.  Henry Winkler's monotone delivery of the Christmas Carol combined with a trite and confusing screen play was only made worse by the frequent interruptions of a black screen, since this was an adaptation of a TV production in 1979 converted to a DVD.  The make-up in the movie was distracting to a fault, looking like it had been applied with a masonry trowel and topped by one of the worst hairpieces since George Burns was alive.Although the new Scrooge's premise had promise by changing the setting of the story from Victorian England to Depression Era America, the writers did not take advantage of the fairy tale capacities of the story and moral lessons, best taught as allegories.  In this sense having the four visitations (Marley, plus Christmas Past, Present and Yet to Come) done in the context of real-life characters from the TV production itself, had a less dramatic impact on the events.  Simply stated, Marley should have been a tortured spirit, attempting to right a long life of wrong decisions instead of appearing like a characterized mobster from a B-movie.  In addition the 70's hipster, as Christmas Yet to Come, was several decades from being relevant to the plot, or as sinister, foreboding and silent as the representation of a lonely death.  Last, but not least, the conclusion of the story appeared rushed and lacked substance, more so than many versions I have seen. In this sense sending the young boy to Australia to cure his malady was more detail than I required and most likely confusing to anyone not familiar with the period in America.This review (2012) is based on a recent watching of the video I purchased a number of years ago for my collection. However, if you are reading this you should understand the context in which the TV movie was made.  Winkler was at the height of his popularity from the Happy Days series when he portrayed this part, and in addition to his early success, has evolved into an accomplished actor, director, producer and author.  It all goes to show you that one bad decision does not a career make, so there is hope for all of us, every one.", "overall": 1.0, "summary": "A perfect storm leading to disaster", "unixReviewTime": 1354406400, "reviewTime": "12 2, 2012"}
    {"reviewerID": "A2BMBZ9H4XTKJB", "asin": "0005019281", "reviewerName": "Jeanelle Murphy", "helpful": [0, 0], "reviewText": "Great, wholesome family movie with a great message. Fabulous acting as well. We will watch again with our young kids.", "overall": 5.0, "summary": "Great family movie!", "unixReviewTime": 1387324800, "reviewTime": "12 18, 2013"}
    {"reviewerID": "A116NVCXW1F7N1", "asin": "0005019281", "reviewerName": "Jeff Blizard", "helpful": [0, 0], "reviewText": "The story line is great, and still love the message, but the picture quality of the reproduction was not the best. But all in all still love the film", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1356393600, "reviewTime": "12 25, 2012"}
    {"reviewerID": "A1IMO6SR37U67K", "asin": "0005019281", "reviewerName": "Jeffery Lakeshire", "helpful": [0, 0], "reviewText": "Every few Christmas seasons I watch this with my Mom.  The film makes us feel so good....it is well acted and never fails to leave a good feeling inside.", "overall": 5.0, "summary": "feel good film", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
    {"reviewerID": "A21EK0DB4PYUJE", "asin": "0005019281", "reviewerName": "Jeffery Lee Naffziger \"movie buff\"", "helpful": [0, 0], "reviewText": "i loved henry winkler in this movie i thought he did a great job  of acting", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1264809600, "reviewTime": "01 30, 2010"}
    {"reviewerID": "ATXWVGLKWDPX4", "asin": "0005019281", "reviewerName": "Jeffrey A. Harrell \"WarDog\"", "helpful": [0, 0], "reviewText": "I watched this when it came out on tv way back when, and I have looked for it ever since. I was so shocked when I saw it on here and I just had to have it. WATCH THIS, IT IS GREAT!!", "overall": 5.0, "summary": "An outstanding movie", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
    {"reviewerID": "A361AJADCBWTFE", "asin": "0005019281", "reviewerName": "Jeffrey Baxter", "helpful": [0, 0], "reviewText": "Really a unique twist on a classic.  Loved this movie since I was a kid.  Great to have it in my collection!", "overall": 5.0, "summary": "Loved this movie since I was a kid", "unixReviewTime": 1399420800, "reviewTime": "05 7, 2014"}
    {"reviewerID": "A306NASGVUDFKF", "asin": "0005019281", "reviewerName": "Jeffrey E \"jeffinaustintx\"", "helpful": [10, 14], "reviewText": "My wife and I grew up in New Hampshire where this version takes place; so we can easily relate to the characters and setting.  Asside from this, we both really like this version because it places the story in a more comfortable setting in general; early America versus England.Both spins are great, this just adds to an already powerful Christmas message.", "overall": 5.0, "summary": "A refreshing twist on a Holiday classic", "unixReviewTime": 1132963200, "reviewTime": "11 26, 2005"}
    {"reviewerID": "A7Z79SQVWV2N0", "asin": "0005019281", "reviewerName": "JEFFREY H BLANK", "helpful": [2, 2], "reviewText": "This Henry Winkler film never received (even today) the attention it deserved. An American adaptation of the Charles Dickens classic tale, this film will quickly become a Christmas family favorite for any household which celebrates the holiday. It's a must-see picture, and is genuinely different from the original English version of the story. You won't be disappointed!", "overall": 5.0, "summary": "Film doesn't get enough credit", "unixReviewTime": 1364601600, "reviewTime": "03 30, 2013"}
    {"reviewerID": "A38G1NN5SD81GD", "asin": "0005019281", "reviewerName": "Jeneen Malone", "helpful": [0, 1], "reviewText": "This is a first for me, I didn't like this movie and I think I only had it on for about 20 minutes.  Acting just wasn't there.", "overall": 2.0, "summary": "Not my favorite", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
    {"reviewerID": "A24JX137XMBA7H", "asin": "0005019281", "reviewerName": "Jerry B", "helpful": [0, 0], "reviewText": "This movie is ok.  I love the middle of the movie.  The three spirits could have brought more action. Nice", "overall": 3.0, "summary": "Christmas Carol", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "A197O2J5BA4AQ", "asin": "0005019281", "reviewerName": "J. E. Wolfe", "helpful": [0, 0], "reviewText": "Henry Winkler is one of my favorite actors of all time.  He is wonderful in An American Christmas Carol!  This is another movie that has not been shown at Christmas in the last few years, but should be.  So glad that I could get it for my collection of favorite Christmas movies.", "overall": 5.0, "summary": "A Classic", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
    {"reviewerID": "A2OHY2ZPWUX1XR", "asin": "0005019281", "reviewerName": "Jim Spradlin", "helpful": [0, 0], "reviewText": "Henry Winkler does a great acting job as he protrays &#34;Mr. Scrooge.&#34; Here again one the whole family can enjoy!", "overall": 5.0, "summary": "Finnally a version for America!", "unixReviewTime": 1353715200, "reviewTime": "11 24, 2012"}
    {"reviewerID": "A1FMDF1NOYM3M7", "asin": "0005019281", "reviewerName": "Joanne", "helpful": [0, 0], "reviewText": "I hadn't seen this in decades and was thrilled to see it again.  The interview with Henry Winkler was a nice plus!", "overall": 5.0, "summary": "Great version of &#34;A Christmas Carol&#34;", "unixReviewTime": 1356998400, "reviewTime": "01 1, 2013"}
    {"reviewerID": "A2KA3OCRR283W5", "asin": "0005019281", "reviewerName": "Joel Peterson", "helpful": [0, 0], "reviewText": "This is one of the best Dickens based Christmas movies of all time.  Henry Winkler portrays a very believable rendition as Benedict Slade, the American &#34;Scrooge&#34;.  I make it a yearly &#34;must see&#34; every Christmas season.  There is one scene that, no matter how many times I view it, brings tears to my eyes.  If you like &#34;feel good&#34; Christmas movies, don't miss this one!!", "overall": 5.0, "summary": "One of the best Christmas movies ever", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
    {"reviewerID": "A1OV1U09Q6KXQJ", "asin": "0005019281", "reviewerName": "John B in MN", "helpful": [0, 0], "reviewText": "In my opinion, the best of the Christmas Carol movies. Henry Winkler does a good job portraying Scrooge, especially with his reputation as the Fonz.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1361664000, "reviewTime": "02 24, 2013"}
    {"reviewerID": "A2YRWE73IZYN0P", "asin": "0005019281", "reviewerName": "John F. Jamele", "helpful": [0, 0], "reviewText": "I loved this film when it was on tv when I was in High School; seeing it on DVD was an enjoyable experience, but I found an annoying problem in continuity: Winkler's character seems to be growing up in the 1890s, which is fine, but at one point we see him at a WWI War Bond Rally, and he seems to be in his early-thirties.  Yet just fifteen years later, during the Great Depression, he's a very old man.  So what's the deal?  It seems as if the film's producers just happened to have a few WWI-era cars and costumes and posters hanging around, so they decided to twist time around to fit the props.  It doesn't make a whole lot of sense for Winkler's character to be a young boy in what seems to be the early-Industrial Revolution, then a young man during WWI, then a very old man during the Depression.  Very odd.I have to believe that if they hadn't had some WWI posters and banners and cars available, they would have cut out the War Bond Rally part and kept the continuity intact.  When Slade sees his gravestone, it appears that he was born in 1876- which would make him just over forty in the War Bond scene, and in his mid-fifties in 1933, when the film is supposed to be taking place.  Maybe it's because I'm a history teacher, but this part always bugged me.  Maybe they should have had everyone excited about the Spanish American War of 1898- that would have made a lot more sense, but they would have had to save the scenes with the cars for later. They could have placed the first scene at the end of the Civil War (that would have allowed for some nice props,) making his age in 1933 more believable.  Oh well, great movie.", "overall": 4.0, "summary": "Fun, but odd continuity problems", "unixReviewTime": 1198454400, "reviewTime": "12 24, 2007"}
    {"reviewerID": "A2C6T0EGXU0UP0", "asin": "0005019281", "reviewerName": "Joseph M DeAngelo", "helpful": [0, 0], "reviewText": "This was a movie from my youth that I would watch every year. I just love it. I am a Charles Dicken fan.", "overall": 4.0, "summary": "Great Holiday Movie", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
    {"reviewerID": "A2P64DWIPY4O2", "asin": "0005019281", "reviewerName": "joycemarie 58", "helpful": [0, 0], "reviewText": "This is one of my favorites... I was very happy to see it on this site. Henry Winkler  played this part well.", "overall": 5.0, "summary": "joycemarie58", "unixReviewTime": 1357430400, "reviewTime": "01 6, 2013"}
    {"reviewerID": "A26Q6QE0J3L0VX", "asin": "0005019281", "reviewerName": "JPWIZ", "helpful": [0, 0], "reviewText": "All I can say is watch it and judge for yourselves.  I used to live in Concord, and it is not truly historically accurate. though there does appear to be a genuine Concord Coach in Slade's barn and there is indeed still a granite  quarry.", "overall": 5.0, "summary": "The Fonz is great in this classic", "unixReviewTime": 1387843200, "reviewTime": "12 24, 2013"}
    {"reviewerID": "A2KJO4L7YN3UZW", "asin": "0005019281", "reviewerName": "Jules & Eades", "helpful": [0, 0], "reviewText": "Should be included in your holiday movies collection.  Funny though to be reminded how much TV you watched BEFORE a commercial break back in the early 80's (as it was a made for TV movie).  Henry Winkler does a great job playing an American/Depression era version of Mr Scrooge.  Corny (but what Christmas Carol version isn't?) but fun.", "overall": 3.0, "summary": "Christmas Carol by Henry Winkler", "unixReviewTime": 1199145600, "reviewTime": "01 1, 2008"}
    {"reviewerID": "A214JCZTENHWX5", "asin": "0005019281", "reviewerName": "Justin Barwick", "helpful": [0, 0], "reviewText": "Henry Winkler does a wonderful job with this version of the classic Christmas Carol story. It is a movie for the whole family. Take time to watch it.", "overall": 5.0, "summary": "Great Movie", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A1GV5U0I80BRCA", "asin": "0005019281", "reviewerName": "jw", "helpful": [0, 0], "reviewText": "Good remake of Christmas Carol with relatively few twists.  Set during the great depression in the U.S. Henry Winkler is generally good, but gives a few too many Fonzi looks for me.", "overall": 4.0, "summary": "Good remake", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
    {"reviewerID": "A28L7RYP6FYGN9", "asin": "0005019281", "reviewerName": "Karen L Rae", "helpful": [0, 0], "reviewText": "Henry Winkler plays a great part in this movie, brings it to life! Good modern version of Scrooge! Don't miss this classic", "overall": 5.0, "summary": "Great Story", "unixReviewTime": 1391817600, "reviewTime": "02 8, 2014"}
    {"reviewerID": "A1T1XX0ZXMKI08", "asin": "0005019281", "reviewerName": "Karen McElroy", "helpful": [0, 0], "reviewText": "I saw this movie a long time ago, actually my brother taped it on a VHS and let me borrow it (guess that tells yu how long ago it was!)  Anyway if you like the old Christmas Carol movies...you'll love this one.", "overall": 5.0, "summary": "Great American Movie", "unixReviewTime": 1360368000, "reviewTime": "02 9, 2013"}
    {"reviewerID": "A1I0N5I3B6HX0C", "asin": "0005019281", "reviewerName": "Kathleen A. Breiding", "helpful": [0, 0], "reviewText": "\"Scrooge\" will never be seen the same after you watch Henry Winkler perform!He brings depth to his character and makes this story more than merely an old miser waking up to the wretched reality of his existence.  \"Mr. Slade\" becomes someone we can understand, someone whose ambitions become a source of tragedy in his life; it was never his intention to become such a cold-hearted skinflint -- he simply allowed his thirst for \"success\" to blind his view.For anyone who appreciates art in its purest form, this movie is a must!!", "overall": 5.0, "summary": "A new perspective...", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
    {"reviewerID": "A78D02YDLHDJ9", "asin": "0005019281", "reviewerName": "Kathleen Fields", "helpful": [0, 0], "reviewText": "I thought the cast and acting was very good, and the variation on the old familiar plot was done well and interesting.", "overall": 4.0, "summary": "Enjoyed it very much", "unixReviewTime": 1389484800, "reviewTime": "01 12, 2014"}
    {"reviewerID": "AEJHL4TIP7GQ7", "asin": "0005019281", "reviewerName": "Kathleen Jarvis", "helpful": [0, 0], "reviewText": "It didn't grab our attention enough to finish it.  It was probably okay if it was the first Christmas movie you watched this season.", "overall": 3.0, "summary": "Didn't finish watching it", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
    {"reviewerID": "A3TOZUVS3TM75X", "asin": "0005019281", "reviewerName": "Kathryn Belville", "helpful": [0, 0], "reviewText": "Too many good originals available to spend time watching this movie.  I didn't like Henry Winkler at all in the 'Scrooge' role.I thought his acting was substandard.", "overall": 3.0, "summary": "Prefer the Dickens Version", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A2J7IA24KAAJ03", "asin": "0005019281", "reviewerName": "Kathy Deskins", "helpful": [0, 0], "reviewText": "Henry Winkler is the one of the best Scrooge I've seen! We see a lot of Scrooge movies this was a breath of fresh air.", "overall": 4.0, "summary": "I really likes Henry Winkler in this adaptation of Scrooge!", "unixReviewTime": 1385856000, "reviewTime": "12 1, 2013"}
    {"reviewerID": "A1HJ3DYNXAD7WR", "asin": "0005019281", "reviewerName": "Kathy", "helpful": [0, 0], "reviewText": "I had been looking for this dvd for years.  Finally able to find on Amazon and am very pleased with the dvd.", "overall": 5.0, "summary": "review of dvd", "unixReviewTime": 1318896000, "reviewTime": "10 18, 2011"}
    {"reviewerID": "A2EBCDL7P2PA3N", "asin": "0005019281", "reviewerName": "Katie Shelley", "helpful": [0, 0], "reviewText": "I remember watching it on TV many years ago and enjoying it then.  Just wanted to relive that time and I was not disappointed.", "overall": 4.0, "summary": "Memories", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
    {"reviewerID": "A2S689D469XHA1", "asin": "0005019281", "reviewerName": "kaycey", "helpful": [0, 0], "reviewText": "This is one of my favorite versions of the Scrooge story but they never show it now I can watch when I want to", "overall": 5.0, "summary": "This is one of my favorite but they never show it", "unixReviewTime": 1293926400, "reviewTime": "01 2, 2011"}
    {"reviewerID": "A3EQZ5JA8C5K5E", "asin": "0005019281", "reviewerName": "K. Delgado-Miller \"Katie D.\"", "helpful": [1, 2], "reviewText": "The best Christmas movie ever!  I saw this when it was aired on TV back in 1979 and purchased it on VHS when it became available.  It was our family tradition for years to watch this on Thanksgivng evening. I bought DVD copies for my children who now have families of their own who will carry on the tradition.Henry Winkler is amazing in this! No matter how many times I've seen this, I still laugh and cry.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1231804800, "reviewTime": "01 13, 2009"}
    {"reviewerID": "AAQRCX68WH7YK", "asin": "0005019281", "reviewerName": "KD", "helpful": [0, 0], "reviewText": "This movie is definitely a knock off of a Christmas Carol.  This version is Americanized.  It was ok but to a ground breaker.", "overall": 3.0, "summary": "remake of a classic", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
    {"reviewerID": "A8VV10NKQ11QO", "asin": "0005019281", "reviewerName": "Keith C. Torbet", "helpful": [0, 0], "reviewText": "This is a good adaptation of Scrooge. Set during the American depression. Henry Winkler Makes a convincing scrooge in this movie.", "overall": 4.0, "summary": "good adaptation", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "AFWFSEHPJABT9", "asin": "0005019281", "reviewerName": "Kelly J. Warburton", "helpful": [2, 3], "reviewText": "How coincidental that this program, aired by ABC in 1979, is set in the USA during the Depression era and here we are 30 years later, in 2009, experiencing an economic malaise of our own!  I remember having seen this on TV but viewing it again now on DVD made me realize that I'd forgotten about how downright mean and cold-hearted Henry Winkler's character, Benedict Slade, really is!!!  Politically-correct viewing in the 21st Century has really insulated from harsh emotions such as those portrayed by Mr. Winkler.  The production has that 70's look to it but it is well done and the actors and actresses all bring an unpolished genuine-ness to their parts.  Being a fan of \"A Christmas Carol\" by Charles Dickens, I am pleased to have this rendition alongside other classic versions as well as the 1984 IBM production.", "overall": 5.0, "summary": "Relevant!!!", "unixReviewTime": 1259971200, "reviewTime": "12 5, 2009"}
    {"reviewerID": "A1FGBY4G9TEOJZ", "asin": "0005019281", "reviewerName": "Kelly Mc \"bookworm\"", "helpful": [4, 6], "reviewText": "This is a great movie...It's a great twist of the original and Henry Winkler does an outstanding job as Mr. Slade.  I love the ending.", "overall": 5.0, "summary": "Great Feel Good Movie", "unixReviewTime": 1127260800, "reviewTime": "09 21, 2005"}
    {"reviewerID": "AR5EWP9FE8SG5", "asin": "0005019281", "reviewerName": "kendra", "helpful": [0, 0], "reviewText": "Purchased this for my mother since she has been looking for a copy. She was so happy when she opened it on Christmas!", "overall": 4.0, "summary": "Loved it", "unixReviewTime": 1357948800, "reviewTime": "01 12, 2013"}
    {"reviewerID": "A311FRUP9Z7ABH", "asin": "0005019281", "reviewerName": "kenna Wright", "helpful": [0, 0], "reviewText": "I give this 4 stars because you mix Henry Winkler with Christmas and you have the best Scrooge movie ever!", "overall": 5.0, "summary": "Best Christmas Movie", "unixReviewTime": 1387756800, "reviewTime": "12 23, 2013"}
    {"reviewerID": "A1CJHBRQIG5MS5", "asin": "0005019281", "reviewerName": "Kenneth Israel", "helpful": [8, 10], "reviewText": "Like many other reviewers, I first saw this as a kid on television in '79 and Henry Winkler's &quot;Fonzie&quot; persona was still so much a part of the cultural fabric that it was somewhat shocking to even think of him, much less see him, as anything else.However, I was transfixed by this adaptation on the Dickens story and was genuinely moved by Winkler's ( Benedict Slade ) transformation at the end. Winkler is simply superb: believable, funny, dramatic, and imminently likable even as the curmudgeon. The supporting cast is wonderful as well even though most of them, with the possible exception of David Wayne, will be unknown to most viewers. The actor who plays Thatcher (the &quot;Cratchit&quot; character in the Dickens novel) does a wonderful job of being as compassionate as the role demands without being too &quot;soft&quot;.The actors playing the roles of Mr. Brewster and Helen Brewster also hold their own and give Winkler solid performances to react to even with limited screen time.The movie looks and feels like I would imagine turn of the century and Depression era New England to look and feel like to an outsider: quaint, majestic, proud; yet tired and despairing.My only problem with the movie, and this is REALLY nitpicking, is that they simply made Winkler look too old for the latter Slade (&quot;Scrooge&quot;) part. the movie does an excellenet job of letting us know when things are happening, even in the Christmas Past scenarios, e.g., we know Slade and Helen broke up around 1917 because of the backdrop of the war effort (WW I). The contemporary story is set in 1933 and Slade looks like he has aged forty years instead of only 16 or so. He looks MUCH older than his contemporaries. However, maybe they intended to achieve this effect to accentuate his gnarliness. I just thought it was too much. The only other thing is that many of the actors are obviously Canadian born (Mr. and Mrs. Thatcher and Helen , for example)and several times their Canadian tones and speech patterns come out. This is noticeable particularly against the distinctive New England accents employed throughout the rest of the picture.I recommend this DVD highly for anyone who loves the Christmas season, the Dickens novel in particular, Henry Winkler, or just any good heartwarming story. I looked for this on DVD and/or VHS for almost twenty years.It was worth the wait.", "overall": 5.0, "summary": "Excellent...", "unixReviewTime": 1040601600, "reviewTime": "12 23, 2002"}
    {"reviewerID": "A38I4SUI5XZVUT", "asin": "0005019281", "reviewerName": "Ken Pandozzi", "helpful": [0, 0], "reviewText": "Great American Versions of the Dickens's Classic.Enjoyed it very much This video is worth buying.It has a modern view of a &#34;Christmas Carol&#34;.", "overall": 5.0, "summary": "Wonderful", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
    {"reviewerID": "A3P98J5DZ00A75", "asin": "0005019281", "reviewerName": "Ken Roberts \"social historian\"", "helpful": [44, 46], "reviewText": "Henry Winkler proves his acting ability in this American version of the Dickens classic. One will actually forget that he was 'The FONZ' and will be amazed at his transformation from nice guy to mean guy back to nice guy. The general feel of this movie, though, is grey. That's the best way to describe it. But then, it was a bleak grey time in American history, with the Great Depression and all. When Dickens originally wrote the book, it was a grey time in England's history as well, so the subdued feeling one gets while watching this 'modern' version fits in well with the spirit of the original story.A nice twist (sorry, Oliver!) to a true classic.By the way, for my money, the finest original version out there is the George C. Scott version followed closely by Alistair Sim.", "overall": 4.0, "summary": "grey", "unixReviewTime": 1003449600, "reviewTime": "10 19, 2001"}
    {"reviewerID": "AYE6KHD4A9CJN", "asin": "0005019281", "reviewerName": "Kevin Barnett \"KD Barnett\"", "helpful": [0, 0], "reviewText": "I first saw this movie as a kid in the late 70's. I never forgot and when i found it on dvd i could not resist. It brought just as much enjoyment now as then. I like the twist on a classic with an American version.", "overall": 4.0, "summary": "The Fonz does Scrooge", "unixReviewTime": 1261526400, "reviewTime": "12 23, 2009"}
    {"reviewerID": "AKYF4DAGHMC7N", "asin": "0005019281", "reviewerName": "Kimee Cat \"Kim\"", "helpful": [2, 2], "reviewText": "This is a version of A Christmas Carol, that most haven't seen.  It is done well and Henry Winkler plays a perfect scrooge.  I love it!", "overall": 4.0, "summary": "Over looked version of the classic tale", "unixReviewTime": 1162771200, "reviewTime": "11 6, 2006"}
    {"reviewerID": "A2602YF29FSZNR", "asin": "0005019281", "reviewerName": "Kindle Customer", "helpful": [0, 0], "reviewText": "This is an excellent version of the Dickens classic.  You should see it.  This was bought as a gift for my wife and she loves it.  It came in great shape and shipping was FAST!", "overall": 5.0, "summary": "Love this version", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
    {"reviewerID": "A17KSWS3YKNK4F", "asin": "0005019281", "reviewerName": "Kipp Bachurski", "helpful": [0, 0], "reviewText": "Evry year at Christmas we watch this movie , it's an American Classic . Henry Winkler is fantastic . Our 22 year old daughter had never seen it before and she said it was excellent .", "overall": 5.0, "summary": "One of the Best", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
    {"reviewerID": "A3ITQD4VL6DSBN", "asin": "0005019281", "reviewerName": "Kitty", "helpful": [0, 0], "reviewText": "It was pretty good. It takes the classic Christmas carol set originally in London and brings it to America.  Henry Winkler does a good Scrooge character", "overall": 3.0, "summary": "An American Christmas Carol", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "ATAGA4N9SMWWQ", "asin": "0005019281", "reviewerName": "KP", "helpful": [0, 0], "reviewText": "Although my husband prefers the original Christmas carol, he does like this as well.  I love it. Henry Winkler is very good in this movie. A nice change from the original Christmas carol movies.", "overall": 5.0, "summary": "still love it", "unixReviewTime": 1351468800, "reviewTime": "10 29, 2012"}
    {"reviewerID": "ABPMYPTXNN034", "asin": "0005019281", "reviewerName": "krazypa \"movie crazy\"", "helpful": [0, 4], "reviewText": "Io One word WONDERFUL MOVIE Henrey Winkler dose great job in this movie. A movie for the all family to watch if you love him as the fonz you love him as slade (scrooge)", "overall": 5.0, "summary": "Wonerful", "unixReviewTime": 1101686400, "reviewTime": "11 29, 2004"}
    {"reviewerID": "A1MUTGFKWD74U4", "asin": "0005019281", "reviewerName": "Kris Stanisci", "helpful": [0, 0], "reviewText": "This is my favorite Christmas Carol movie. I have waited for it to come out, and when I finally looked it up again, I bought it!", "overall": 5.0, "summary": "Favorite", "unixReviewTime": 1391040000, "reviewTime": "01 30, 2014"}
    {"reviewerID": "A1PF789NYOCR67", "asin": "0005019281", "reviewerName": "Larry Cook", "helpful": [0, 0], "reviewText": "One of the better Christmas movies made.  Henry Winkler plays a superb role.  Really enjoy the different slant on the old Charles Dickens movie.", "overall": 5.0, "summary": "Great change of pace", "unixReviewTime": 1387324800, "reviewTime": "12 18, 2013"}
    {"reviewerID": "A13MTBI2DEEQ0K", "asin": "0005019281", "reviewerName": "Larry White", "helpful": [0, 0], "reviewText": "I have always enjoyed this movie.  I had it on DVD but wanted it on Blue Ray and the quality is excellent.  I have no complaints and am very pleased to buy from Amazon.", "overall": 5.0, "summary": "Excellent.  Loved it.", "unixReviewTime": 1355616000, "reviewTime": "12 16, 2012"}
    {"reviewerID": "A1BOKOBCBRVSKD", "asin": "0005019281", "reviewerName": "Laura J DeBusk", "helpful": [0, 0], "reviewText": "Have been looking for the Henry Winkler 'An American Christmas Carol'.  This is a different take on the movie.  Order and enjoy!", "overall": 5.0, "summary": "Finally I Found It!", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
    {"reviewerID": "A38JFF6SGZEO37", "asin": "0005019281", "reviewerName": "Lauren", "helpful": [0, 0], "reviewText": "I love An American Christmas Carol with Henry Winkler.  In my opinion it is the very best version of Scrooge.  Hope everyone sees it and enjoys it as much as I do.", "overall": 5.0, "summary": "The Best Film about Scrooge!", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
    {"reviewerID": "A3OH2Q2UID4FYX", "asin": "0005019281", "reviewerName": "LeeAnn", "helpful": [0, 0], "reviewText": "This is one of my husbands favorite xmas movies and we only had it on VHS....so I was thrilled to see it available on a DVD & at a great price! Was delivered quickly and we could enjoy it as we decorated!", "overall": 5.0, "summary": "So glad I could get this on a DVD", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
    {"reviewerID": "A125TLIUTYSWTB", "asin": "0005019281", "reviewerName": "Leila G.", "helpful": [0, 0], "reviewText": "I love the Dickens story and this is a Depression-era take on that classic. Winkler is very good as the cranky Mr. Scrooge.", "overall": 5.0, "summary": "Different", "unixReviewTime": 1394841600, "reviewTime": "03 15, 2014"}
    {"reviewerID": "A36ZT22MM9JWTK", "asin": "0005019281", "reviewerName": "lholguin715", "helpful": [0, 0], "reviewText": "The movie was everything that we expected.  When we had recorded the movie from the TV with all the commercials. We had been looking for the VSH or DVD, but could not find it in the stores. When I checked Amazon and you had the movie I jumped on purchasing it. Thank you for caring things that you can't find in Department Stores.", "overall": 5.0, "summary": "An American Christmas Carol!!", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
    {"reviewerID": "A2GLXOJMEEBP1K", "asin": "0005019281", "reviewerName": "l. hops", "helpful": [0, 0], "reviewText": "I enjoy watching Henry Winkler other then as the Fonz. He is at his best in this movie. I recommend this movie.", "overall": 5.0, "summary": "Love this movie!!!", "unixReviewTime": 1359244800, "reviewTime": "01 27, 2013"}
    {"reviewerID": "A18Z6PU746PM8Z", "asin": "0005019281", "reviewerName": "Lianna", "helpful": [0, 0], "reviewText": "I saw this version of a Christmas Carol years ago and it left quite an impression on me. There are many versions of this story, but very few that really capture the story well. This is one of those. If you've never seen it, you must!", "overall": 5.0, "summary": "One of the best versions of this movie!", "unixReviewTime": 1389916800, "reviewTime": "01 17, 2014"}
    {"reviewerID": "A2F3GFAA3XQDIB", "asin": "0005019281", "reviewerName": "libra peacemaker", "helpful": [0, 1], "reviewText": "This modern adaptation of A Christmas Carol is engaging and includes a well-known modern screen actor.  The inclusion of an orphanage as background material also gives an individual twist to this classic.", "overall": 4.0, "summary": "Fonzie Grows Up Christmas Eve", "unixReviewTime": 1231545600, "reviewTime": "01 10, 2009"}
    {"reviewerID": "A1ZIBVOIPBWR3U", "asin": "0005019281", "reviewerName": "Lilac Lover", "helpful": [0, 0], "reviewText": "This is one of my fav versions....set during the Depression in America. It's unique regarding Scrooge's upbringing in an orphanage (when he repossess the orphanage's piano on  Christmas Eve!)", "overall": 5.0, "summary": "Love this version of Scrooge!", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
    {"reviewerID": "A3F0CD2AUDAO9K", "asin": "0005019281", "reviewerName": "Lisa Bucci", "helpful": [0, 0], "reviewText": "This is a great Christmas Classic.  My husband introduced me to it years ago and it's our favorite hoilday movie.  Henry Winkler does a great job.  Definitely recommend.", "overall": 5.0, "summary": "A Christmas Classic!", "unixReviewTime": 1387756800, "reviewTime": "12 23, 2013"}
    {"reviewerID": "A6URPIREGDQ9K", "asin": "0005019281", "reviewerName": "Lynn I", "helpful": [0, 1], "reviewText": "Just  OK, I had a a hard time putting &#34;Fonzie&#34; as a gruff person, and to me it was just OK, glad I watched it but not one of my favorites.", "overall": 3.0, "summary": "Just ok", "unixReviewTime": 1384473600, "reviewTime": "11 15, 2013"}
    {"reviewerID": "A2PSMIRDHYYONP", "asin": "0005019281", "reviewerName": "margaret bish", "helpful": [0, 0], "reviewText": "We watch this every year, as well as the original story with George C. Scott....good contrast in stories and wonderful treats.", "overall": 5.0, "summary": "Holiday favorite", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
    {"reviewerID": "A3J720X9Y6VUFO", "asin": "0005019281", "reviewerName": "Marian", "helpful": [0, 1], "reviewText": "My daughter saw this movie when she was young and we have waited years for it to become available. We purchased this as a christmas gift for her, She just loves it. Thank you", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
    {"reviewerID": "A3T8RYH5HYNBNH", "asin": "0005019281", "reviewerName": "Mariel", "helpful": [0, 0], "reviewText": "I liked this production giving the possible American point of view.  We've all seen the original Christmas Carol but I'd highly recommend this to anyone.  We watched this with our grandchildren whose interest was kept the entire length.", "overall": 4.0, "summary": "Thought provoking", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
    {"reviewerID": "A2YLI6HFRRXDKX", "asin": "0005019281", "reviewerName": "Marjorie Harris", "helpful": [0, 0], "reviewText": "I thought his was a great twist on A Christmas Carol that put it in a more relevant perspective for these times", "overall": 5.0, "summary": "Loved it", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
    {"reviewerID": "A2L207YQOE1HWP", "asin": "0005019281", "reviewerName": "Mark C. Butler", "helpful": [0, 0], "reviewText": "As we were picking Christmas movies this year, I remembered seeing one with Henry Winkler.  Took me a while to find it because I didn't recall the title correctly.  Told my wife she would really like it.  Was not disappointed.  A very good Christmas classic in my book.  Winkler is terrific in this role.", "overall": 4.0, "summary": "Great twist on the classic.", "unixReviewTime": 1353715200, "reviewTime": "11 24, 2012"}
    {"reviewerID": "A3Q3F2D0XZ0VCC", "asin": "0005019281", "reviewerName": "Mark R. Trifkovic \"zzorran\"", "helpful": [0, 0], "reviewText": "Great unless you are just tired of Christmas movies along Charles Dickens Christmas Carol theme.  It is certainly one of the better ones based on Dickens book and had been unavailable for purchase for to many years", "overall": 5.0, "summary": "GREAT", "unixReviewTime": 1391126400, "reviewTime": "01 31, 2014"}
    {"reviewerID": "ABF7QC42YCJ0F", "asin": "0005019281", "reviewerName": "Mark T. Roberts", "helpful": [0, 0], "reviewText": "I 'collect' movie versions of 'A Christmas Carol', This is a very good one. It is true to the spirit of the book while putting an American spin on it. If you really like Dicken's story you will probably enjoy this version.", "overall": 4.0, "summary": "A Good Effort", "unixReviewTime": 1380931200, "reviewTime": "10 5, 2013"}
    {"reviewerID": "A36WRNUD3V57JK", "asin": "0005019281", "reviewerName": "Maryanne Schubert", "helpful": [0, 0], "reviewText": "I almost began with &#34;what can I say&#34;. Well, thinking about it I can say much about this Christmas tale. It is a great twist on a classic holiday movie. Henry Winkler is well know for his role as the &#34;Fonz&#34;. He owned this movie through his portrayal of a miserable miser. His gradual aging from youth to old age was quite amazing. Oh Henry, you prove over and over what a quality actor can do for stage and screen.", "overall": 5.0, "summary": "\"Oh Henry\"", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"}
    {"reviewerID": "A2BEOF8YBRY010", "asin": "0005019281", "reviewerName": "Mary Ann of Maryland", "helpful": [0, 0], "reviewText": "I was very happy with the time it took to deliver.  The quality of the movie is great!  The DVD case was a little thin.", "overall": 5.0, "summary": "Good Holiday Movie", "unixReviewTime": 1359158400, "reviewTime": "01 26, 2013"}
    {"reviewerID": "A2OKAPRYQXPWDD", "asin": "0005019281", "reviewerName": "Mary E. Wendt", "helpful": [0, 0], "reviewText": "Remakes of classic films are often terrible, but Winkler is memorable in this remake of Dickens' classic tale. I saw it once on TV years ago and have been looking for it ever since. Voila! on Amazon. If you like a good Christmas story--even if you already know the ending--this one is fun and heartwarming.", "overall": 4.0, "summary": "Classics Done Right", "unixReviewTime": 1386979200, "reviewTime": "12 14, 2013"}
    {"reviewerID": "A3U2YEOEBJ0M4M", "asin": "0005019281", "reviewerName": "Mary McMahon", "helpful": [0, 0], "reviewText": "This remake of the Dickens original is effective and realistic portrayal of life during the depression, and it is fun ot watch Henry Winkler in the lead role.", "overall": 4.0, "summary": "American remake of the classic true to Dickens", "unixReviewTime": 1389312000, "reviewTime": "01 10, 2014"}
    {"reviewerID": "AP6JO23GGY82I", "asin": "0005019281", "reviewerName": "Mary Tamburrino", "helpful": [0, 0], "reviewText": "Henry Winkler just did not seem like Scrooge. It felt more like an actor playing Scrooge. In other words, I could not enjoy it as well as some of the other actors as Scrooge. Alistair Sim or Patrick Stewart were much better as Scrooge.", "overall": 3.0, "summary": "American Christmas Carol. Henry Winkler", "unixReviewTime": 1359158400, "reviewTime": "01 26, 2013"}
    {"reviewerID": "A17TPT3FWAE5T1", "asin": "0005019281", "reviewerName": "Matthew Spady \"800rsd\"", "helpful": [30, 40], "reviewText": "If you already have (and love) the Alistair Sim version (Scrooge, 1951), the Reginald Owen version (1938) and Mr. Magoo's Christmas Carol (no, I'm not kidding, it's beautifully done), this will be an interesting film for comparison.Two good points stand out for this version of Dicken's classic Christmas story:1) Since it is an adaptation, set in a different time and place from the original (Depression-era New England), deviations from the text and basic plot-line, are not as bothersome as they are in the films that adapt the story in \"Dickensian\" England.2) Henry Winkler, who, at the time, was playing against his well-known Fonz character, gives an excellent characterization to the Scrooge-like Benedict Slade.George C. Scott and Albert Finney give detailed performances as Scrooge in their version, and the films that feature them have good production values -- and, in the case of the Finney version a couple of good songs -- but the deviations in text in the Scott version and the added material in the Finney version (Scrooge in hell -- what?) are both unnecessary and more than a little annoying.", "overall": 3.0, "summary": "An interesting contrast to more traditional versions", "unixReviewTime": 1008028800, "reviewTime": "12 11, 2001"}
    {"reviewerID": "A2UNEJNV11TNQ9", "asin": "0005019281", "reviewerName": "M. Auker \"Shellsfibers\"", "helpful": [0, 0], "reviewText": "This is a great movie that sets the classic tale of A Christmas Carol in a very American setting.  Set in the time of the Great Depression the character of Scrooge played by Henry Winkler is perfect for this. The heartwarming change of his character, although well known by most, is given such a unique spin that this should become a classic in its own right. The attention to detail by the costuming and sets are wonderful and the makeup staff did an amazing job at aging the young Henry Winkler. You will not regret watching this new twist on the classic tale.", "overall": 5.0, "summary": "A new twist on the Christmas Carol", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
    {"reviewerID": "A19A0YVRQX8B1L", "asin": "0005019281", "reviewerName": "MHamby", "helpful": [0, 0], "reviewText": "Another entry in the retelling of the classic.  Ho hum from start to finish.  Henry Winkler is not believable as a Scrooge type.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
    {"reviewerID": "A3MFFZG662BT0P", "asin": "0005019281", "reviewerName": "Michael Gosha", "helpful": [0, 0], "reviewText": "As usual, Henry Winkler gave a superb performance, (Way to go Fonzie). Owning quite a few movies and cartoons on the Christmas Carol, I must say that this version has a somewhat modern, 20th century, yet fitting theme. I loved it. Highly recommended!", "overall": 5.0, "summary": "Henry Winkler does it again!", "unixReviewTime": 1353110400, "reviewTime": "11 17, 2012"}
    {"reviewerID": "A2B7B7NRBC4IE2", "asin": "0005019281", "reviewerName": "Michel Emond", "helpful": [2, 6], "reviewText": "Bonjour!Je crois que de toutes les versions qui ont &eacute;t&eacute; faites du conte de Charles Dickens, celle-ci est sans doute &agrave; la fois la plus originale et la plus fid&egrave;le.  Le th&egrave;me central est bien respect&eacute; mais l'adaptation est totale puisqu'elle situe l'action en Am&eacute;rique plutt que dans l'Angleterre du 19e si&egrave;cle mais avec une touche d&eacute;but du si&egrave;cle et moderne.Mme si ce film n'est disponible qu'en anglais sur DVD, il vaut la peine d'tre achet&eacute; puisqu'il n'est plus diffus&eacute; &agrave; la t&eacute;l&eacute;vision depuis plusieurs ann&eacute;es suite &agrave; une m&eacute;sentente avec le producteur et il semble bien que la situation n'est pas pr&egrave;s de changer.  C'est un film de collection que tous se doivent de poss&eacute;der pour le temps de Nol.  Une version franaise a jadis &eacute;t&eacute; disponible mais elle ne l'est plus maintenant ce qui est tr&egrave;s malheureux.  Henry Winkler est remarquable.", "overall": 5.0, "summary": "Une oeuvre &agrave; poss&eacute;der!!!", "unixReviewTime": 1041292800, "reviewTime": "12 31, 2002"}
    {"reviewerID": "AK88QX7H7GHI7", "asin": "0005019281", "reviewerName": "Mike S. \"Mike S.\"", "helpful": [0, 0], "reviewText": "This movie was a TV special that we loved, but unfortunately, it was only broadcast a few times!  For some time, it was unavailable in DVD/Blue Ray format.  When we found Blue Ray on Amazon while looking for other Christmas titles, we bought it!", "overall": 5.0, "summary": "This movie was a TV special that we loved, but unfortunately", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
    {"reviewerID": "A3NK0FJRFM8QGN", "asin": "0005019281", "reviewerName": "Mischief", "helpful": [0, 0], "reviewText": "Henry Winkler does an excellent job as the stingy Mr Slade.  The counterpart to Ebeneezer Scrooge in this adaptation of the classic story.  It was wonderfully done.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
    {"reviewerID": "A26RUXN04TN1LA", "asin": "0005019281", "reviewerName": "M. Van Skiver", "helpful": [3, 7], "reviewText": "This classic is even better on dvd.  Great item.  Very happy.", "overall": 4.0, "summary": "An American Christmas Carol DVD", "unixReviewTime": 1122249600, "reviewTime": "07 25, 2005"}
    {"reviewerID": "A2C51NC30YFWXS", "asin": "0005019281", "reviewerName": "Mysterious Mr Wong \"MovieViewer\"", "helpful": [3, 8], "reviewText": "Mr. Winkler failed to capture my attention in this ignoble version of the classic Dickens fable. However, it isn't without a certain charm all its own. And to Henry's credit, and partly to my own blame, I have never been able to seperate Henry Winkler from the Fonz of Happy Days. I can't say that I disliked the movie it just doesn't rate up there with the Christmas classics in my estimation and this is simply my own personal take on the film.If you're looking for a Christmas movie that the whole family can enjoy together on occasion then this DVD will fit right in, but if you're looking to gather movies for your library that are the so called \"must have Christmas movies\" then pass it up for another title.", "overall": 3.0, "summary": "A foible adaptation but not without merit", "unixReviewTime": 1164412800, "reviewTime": "11 25, 2006"}
    {"reviewerID": "A1NSR193UO4F71", "asin": "0005019281", "reviewerName": "Nana4", "helpful": [0, 0], "reviewText": "Christmas brings at least a couple of Christmas Carol stories. This one was more updated in time. I prefer the old ones, but it doesn't mean that this one was bad, just my personal preference.", "overall": 4.0, "summary": "Liked it, but not as good as the old ones", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
    {"reviewerID": "A39M6AAGGZCV6K", "asin": "0005019281", "reviewerName": "Nana of 12", "helpful": [0, 0], "reviewText": "We love this movie with Henry Winkler.  It is very well done & that means a lot.  To us the other Scrooge movies just aren't that good.Highly recommend it!", "overall": 5.0, "summary": "The Best Movie Yet!", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
    {"reviewerID": "A3728VO92PF49A", "asin": "0005019281", "reviewerName": "Nanasue", "helpful": [1, 1], "reviewText": "The Christmas Carol is one of my favorite Christmas stories, and there have been a lot of different versions made. This one, with Henry Winkler, is different. He does a wonderful job playing Scrooge!! The setting is in depression era America, instead of England, and that makes this version better (I think). It's like watching history.This movie is definitely worth watching!!", "overall": 5.0, "summary": "Good Version of the Story!", "unixReviewTime": 1379894400, "reviewTime": "09 23, 2013"}
    {"reviewerID": "A1BV3NHO9BOZVF", "asin": "0005019281", "reviewerName": "Nancy L Moore", "helpful": [0, 0], "reviewText": "I found this take on Scrooge a very interesting and new . Sent it as a gift to my sisiter-in-law to enjoy also !", "overall": 5.0, "summary": "An American Version", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
    {"reviewerID": "A2L6WI77T1DVL6", "asin": "0005019281", "reviewerName": "ngoodtaste", "helpful": [0, 0], "reviewText": "Saw this years ago on network TV and remembered how much I liked it. Winkler did a great job as the \"scrooge\" character. A more \"true to life\" version of \"A Christmas Carol\".", "overall": 5.0, "summary": "Had To Have My Own Copy", "unixReviewTime": 1311033600, "reviewTime": "07 19, 2011"}
    {"reviewerID": "A2PXCBP1MT0GJ0", "asin": "0005019281", "reviewerName": "noemi martinez", "helpful": [0, 0], "reviewText": "I love all the Christmas Carol movies!!!  I had seem this movie only once, when it came out of TV n never saw it again on TV.  I was always looking for it but  could not remember the name of it, only that the actor had been Henry Winkler. Finally I saw it on Amazon and right away bought it n sure enough it was the same movie I had seen in the 70s.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
    {"reviewerID": "A1CMD08Z49PGKQ", "asin": "0005019281", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "If you are looking for something different in your Scrooge this is it.  Winkler does a superb job of acting in this movie.  It follows a different slant on the old classic.  It reveals a new depth to character of Scrooge.  Don't watch this one every year but still worth it.  A must for your Dickens collection.", "overall": 5.0, "summary": "A grand departure from all the other Scrooges.", "unixReviewTime": 1351814400, "reviewTime": "11 2, 2012"}
    {"reviewerID": "A1HP3B92A3JDQ1", "asin": "0005019281", "reviewerName": "OmegaWolf747 \"Aoooooooooooo!\"", "helpful": [4, 6], "reviewText": "Of course it's impossible to separate Henry Winkler from his famous Fonzie persona, but he actually does a great job as a Scrooge-character in this movie.  His performance is quiet and subdued, not overdone as we might expect from such an intense actor.  I thought Winkler did a great job chaning out of his Fonzie image and taking on the roll of an embittered and lonely miser.Actually the characters Winkler plays aren't all that different from each other.  Slade felt abandoned and betrayed by those he'd loved, and Fonzie was also abandoned by his parents.  Winkler's parents turned their backs on him when he was a young man because he wanted to be an actor instead of following the family business.  I believe that's why he does rolls like this so well.I was quite surprised to find this movie available on DVD and have gladly purchased it to add to my collection of Christmas movies.", "overall": 5.0, "summary": "The Fonz as Scrooge", "unixReviewTime": 1036195200, "reviewTime": "11 2, 2002"}
    {"reviewerID": "A40W0OPSWECA6", "asin": "0005019281", "reviewerName": "PAD", "helpful": [0, 0], "reviewText": "This is a great movie, one that has truly been overlooked as one of the great \"Christmas Classics. It brings an refreshing twist to the ageless story of redemption.", "overall": 5.0, "summary": "an overlooked classic", "unixReviewTime": 1323993600, "reviewTime": "12 16, 2011"}
    {"reviewerID": "A39KSHSIHELFYW", "asin": "0005019281", "reviewerName": "pat", "helpful": [0, 0], "reviewText": "I thought Henry Winkler was superb as scrooge. It was a wonderful movie. I would recommend it to anyone, good family viewing", "overall": 5.0, "summary": "Christmas Carol- American style", "unixReviewTime": 1357948800, "reviewTime": "01 12, 2013"}
    {"reviewerID": "A27WO3E4JHTNUS", "asin": "0005019281", "reviewerName": "Pat", "helpful": [0, 0], "reviewText": "My wife's all time favorite Christmas movie around this time of year.  Have been searching for years for this item, and prices up until this year were outrageous.  Product came well packaged with no issues and on time for Christmas eve.  Made my wife's Christmas Eve to have this back in our collection", "overall": 5.0, "summary": "American Christmas Carol", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
    {"reviewerID": "A156IVEEZDFW0S", "asin": "0005019281", "reviewerName": "Patricia Mcintire \"lv2rd\"", "helpful": [0, 0], "reviewText": "What an enjoyable movie, it is a good one to have to go along with all my other versions of The Christmas Carol. It was a different role for Henry Winkler but he made a good Scrooge!", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1264032000, "reviewTime": "01 21, 2010"}
    {"reviewerID": "A3RWLUG09DSNPC", "asin": "0005019281", "reviewerName": "Patricia Raap", "helpful": [0, 0], "reviewText": "Hard to find in a Christmas line up and worth the watching.  Forget he was &#34;The Fonz&#34;.  This is well done.", "overall": 5.0, "summary": "My favorite Scrooge", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
    {"reviewerID": "A2KG7BD0O3UN5Q", "asin": "0005019281", "reviewerName": "patrick wallace", "helpful": [0, 0], "reviewText": "An American Christmas Carol is one of my favorite all time Christmas movies. Henry Winkler is surperb in his performance as a depression era scrooge.I encourage people to watch, they will not be disappointed. Patrick Wallace", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1354579200, "reviewTime": "12 4, 2012"}
    {"reviewerID": "A21HYO0TUMZK72", "asin": "0005019281", "reviewerName": "PattyM", "helpful": [0, 0], "reviewText": "I purchased this for a coworker for Christmas. I haven't given it to her yet. But she has recommended this movie to me, so I am sure she will greatly enjoy it.", "overall": 5.0, "summary": "Christmas gift", "unixReviewTime": 1375660800, "reviewTime": "08 5, 2013"}
    {"reviewerID": "AARUYE130LY8W", "asin": "0005019281", "reviewerName": "Paul D. Race \"Writer, Teacher, Songwriter, Ra...", "helpful": [5, 7], "reviewText": "If you want the classic version, go with the George C. Scott or Patrick Stewart version. If you want the best family version, go with the Muppet Christmas Carol, which stars Michael Caine and is suprisingly good. But if you want to hear the same old story told in a new, effective setting, get this movie.  As a depression-era American miser whose experiences parallel Scrooge's, Henry Winkler gives a convincing (and at times heart-wrenching) performance. The supporting cast, including Dorian Harewood, also turn in exceptional performances. Nothing in this movie is tacky, anachronistic, overacted, or otherwise out of place - it is as well-crafted a Christmas movie as you can find. And if it leaves you completely untouched, let's just say that you may need some nocturnal visitors to give you Christmas spirit a special \"jump start\" this year.  In short, this movie deserves your family's full attention in the coming Christmas season.  I'm glad it's out on DVD, as we've worn out two videotapes of the show.Paul Race, editor, Family Garden Trains(tm)", "overall": 5.0, "summary": "Best Adaptation Ever", "unixReviewTime": 1166400000, "reviewTime": "12 18, 2006"}
    {"reviewerID": "A1R7V3KJUP82NU", "asin": "0005019281", "reviewerName": "PAUL", "helpful": [0, 0], "reviewText": "So hard to find this movie - it is by far the best SCROOGE of them all - used to play on TV every year but not for a long time now, so glad to have my copy now", "overall": 5.0, "summary": "The Best CHRISTMAS CAROL of them all", "unixReviewTime": 1325030400, "reviewTime": "12 28, 2011"}
    {"reviewerID": "A3U1A2XQ6NBE33", "asin": "0005019281", "reviewerName": "Paulie Baggo Donuts", "helpful": [0, 0], "reviewText": "Excellent movie. One of my favorite Christmas Carol versions. The movie takes on the usual Christmas Carol story with an American twist. Henry Winkler is a great actor.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1331769600, "reviewTime": "03 15, 2012"}
    {"reviewerID": "A15GTCK2TKSLFY", "asin": "0005019281", "reviewerName": "perry ander", "helpful": [0, 0], "reviewText": "Nice drama- based on the original Christmas Carol movie.  This version stars Henry Winkler as Scrooge and takes place during the Depression in America.  Winkler plays Scrooge as a business owner who offers home furnishings to be paid off over time.  But most people can,t pay off the entire bill due to job scarcity - etc- and Winkler ends up repossessing much of what he has &#34;sold&#34;.  Soon &#34;ghosts&#34;- ( passed aquaintances in this version)- of Chistmas past, present, and future appear taking Winkler back through time and into the future showing him his past and what the future holds in store for one of his &#34;value system&#34; ,  Winkler realizes that he best become more kinder and more considerate of the needs of his town neighbors or risk dying a lonely and embittered man.  Dramatic with poignant scenes.  Held my attention throughout!", "overall": 4.0, "summary": "Henry Winkler Heads a Fine Drama Based Upon a Well Known Story", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
    {"reviewerID": "A2R69PIUXPYCQW", "asin": "0005019281", "reviewerName": "Petunia022", "helpful": [0, 0], "reviewText": "Henry Winkler's performance was outstanding!  Different slant on time honored favorite Christmas story.  Plan to purchase for our holiday movie collection.", "overall": 5.0, "summary": "An Interesting Twist!  New Holiday Favorite!!", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
    {"reviewerID": "A130DD6CVD40F3", "asin": "0005019281", "reviewerName": "P. Flogaus", "helpful": [0, 0], "reviewText": "I received the dvd in perfect condition and relatively quick.  The seller delivered as promised!If you're a fan of Chrismas Carol movies, this one is a good one to have in your collection.  It's a bit different than the traditional version, but ALL versions are the &#34;same but different&#34;.  I highly recommend this one!", "overall": 5.0, "summary": "Worth Purchasing", "unixReviewTime": 1396483200, "reviewTime": "04 3, 2014"}
    {"reviewerID": "AAUY0WTVO4IGL", "asin": "0005019281", "reviewerName": "Philip", "helpful": [0, 0], "reviewText": "A Family Classic and Henry Winkler makes it great. I would make a great gift for any of your family or friends.", "overall": 5.0, "summary": "Classic. Family enjoys it with Henry Winkler.", "unixReviewTime": 1353542400, "reviewTime": "11 22, 2012"}
    {"reviewerID": "ASWWWVMYF2EVY", "asin": "0005019281", "reviewerName": "pikara", "helpful": [0, 0], "reviewText": "I found this film to be just as uplifting as the classic &#34;Christmas Carol&#34;.  Henry Winkler gave a sterling performance as the cold and indifferent &#34;Scroogelike&#34; character.", "overall": 5.0, "summary": "No \"Fonz\" here!", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
    {"reviewerID": "AA8XMUB8TMVMJ", "asin": "0005019281", "reviewerName": "Pilgram", "helpful": [2, 2], "reviewText": "Worth watching this new version of the classic.  It is a little slow in parts but still entertaining. The real negative issue and distraction throughout is Henry Winkler's make up that is supposed to make him look old.  It just looks like Henry Winkler with make-up that is supposed to make him look old.  Even if you did not know the actor you would know that it was makeup and not an old man.  The wig was very good though--looked very authentic.", "overall": 3.0, "summary": "Made to look old", "unixReviewTime": 1385251200, "reviewTime": "11 24, 2013"}
    {"reviewerID": "A312KM8IVZCEPA", "asin": "0005019281", "reviewerName": "P. Locke", "helpful": [0, 0], "reviewText": "I enjoyed Winkler, well done and interesting throughout.  I must have missed this when it first came out so glad Amazon offered it!", "overall": 5.0, "summary": "Interesting viewpoint", "unixReviewTime": 1387929600, "reviewTime": "12 25, 2013"}
    {"reviewerID": "A370EYV6NOCKCF", "asin": "0005019281", "reviewerName": "Professor125", "helpful": [0, 0], "reviewText": "I have searched for this film for years and finally found it here on Amazon. Saw it on television years ago and it was one I knew I wanted.", "overall": 5.0, "summary": "Great Film!", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}
    {"reviewerID": "A6XG55I7XO2LX", "asin": "0005019281", "reviewerName": "P. Salter", "helpful": [0, 0], "reviewText": "I am a big fan of Dickens and love &#34;A Christmas Carol&#34;.  I have a collection of most versions.  This is not the Alistair Sims classic but is well done in a U.S. depression era setting.", "overall": 4.0, "summary": "Dickens with a twist", "unixReviewTime": 1392681600, "reviewTime": "02 18, 2014"}
    {"reviewerID": "A29TUJ7CU41AV7", "asin": "0005019281", "reviewerName": "P Sullivan", "helpful": [0, 0], "reviewText": "A well done version of the story based in America.  Henry Winkler does an impressive Scrooge and pace of the film and visuals are fantastic.", "overall": 5.0, "summary": "A great overlooked version of the story", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
    {"reviewerID": "A18X2B15DJLZX0", "asin": "0005019281", "reviewerName": "RaeLee", "helpful": [0, 0], "reviewText": "I always liked Henry Winkler in Happy Days and I believe he did a wonderful performance in An American Christmas Carol.  The move, while based on others like it had its own twists and special touches.  It is what my family would call, &#34;a keeper&#34;.", "overall": 5.0, "summary": "A classic", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
    {"reviewerID": "A3TCVBS8C75NUG", "asin": "0005019281", "reviewerName": "Rae M. Bates \"Momma Bates\"", "helpful": [0, 0], "reviewText": "My family really enjoys this more modern re-telling of Dickens' \"A Christmas Carol.\" You have all of the basic elements set in depression-era America. Henry Winkler is fantastic as both the crotchety old Mr. Slade and the idealistic young Mr. Slade. It should really be part of your holiday movie collection.", "overall": 4.0, "summary": "Wholesome Family Fun", "unixReviewTime": 1264809600, "reviewTime": "01 30, 2010"}
    {"reviewerID": "A3M3M2E5N6YOMA", "asin": "0005019281", "reviewerName": "Randall Grossman", "helpful": [13, 15], "reviewText": "&quot;A Christmas Carol&quot; may well be the most-adapted Christmas story in literature, with version ranging from whimsical to musical to deadly serious.  This particular version, starring Henry Winkler as Benedict Slade (a.k.a. Scrooge) is my favorite.The movie translates Dickens' classic story from 19th century England to Depression-era New England.  The result is very effective.  For me, an American born to parents who grew up in the Depression, the 20th century setting made the story feel very real.  The writers and director made excellent decisions in their choice of sets.  Three notable examples were the New England furniture factory as the setting for Slade's youth, the newly-conceived idea of consumer credit as the source of his subsequent wealth and avarice, and the choice of an African-American as the Ghost of Christmas Yet to Come (&quot;You must be Future,&quot; Slade declares, cowering before him).Winkler's performance is brilliant.  He captures the essence of Slade perfectly, and makes the gradual transformation from miser to redeemed man seem natural and believable.  The scene at the Thatcher (a.k.a. Cratchit) household at the end of the film never fails to bring tears to my eyes and those of my family.  The supporting cast performs ably as well, making this a Christmas classic that one can watch every year.&quot;An American Christmas Carol&quot; debuted in 1979, midway through Winkler's popular &quot;Happy Days&quot; television series run.  After a few years of reruns, it disappeared from view until recently, when it became available on DVD and video.  I heartily recommend it for your holiday DVD collection.", "overall": 5.0, "summary": "My Favorite &quot;Christmas Carol&quot;", "unixReviewTime": 1040601600, "reviewTime": "12 23, 2002"}
    {"reviewerID": "A3GKNZLIZ3IH7H", "asin": "0005019281", "reviewerName": "Raymond C. Washburn", "helpful": [0, 0], "reviewText": "This is a great movie. One of the better versions of A Christmas Carol out there. Henry Winkler proves what a great actor he is. Well worth a watch.", "overall": 5.0, "summary": "American Christmas Classic", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}
    {"reviewerID": "AQ5JDBXICB18J", "asin": "0005019281", "reviewerName": "R. Culp", "helpful": [0, 2], "reviewText": "Not the best quality DVD, but it's a great story. I recommend it to all.", "overall": 4.0, "summary": "Excellent story", "unixReviewTime": 1248825600, "reviewTime": "07 29, 2009"}
    {"reviewerID": "A1HBK6HV5TS79U", "asin": "0005019281", "reviewerName": "Rebecca Michaud", "helpful": [0, 0], "reviewText": "Henry Winkler is a gifted actor and pulls off the part of an older man with style.  A new way to look at Dickens classic A Christmas Carol.  I remember this from years ago and was pleased to find it on DVD.Great family entertainment.", "overall": 5.0, "summary": "A New Twist on an Old Classic", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
    {"reviewerID": "A3S1YI6MC7832G", "asin": "0005019281", "reviewerName": "Reviewer", "helpful": [2, 2], "reviewText": "Being a huge fan of this classic, I own dozens of versions and this one  adds a nice variety.  The twists and changes to this timeless story truly  do justice to the original and the performances, for the most part, are  stellar.  If you're looking for the same feel good movie but in a new  setting, this one's for you.", "overall": 4.0, "summary": "A Great New Version of a Wonderful Old Story", "unixReviewTime": 968716800, "reviewTime": "09 12, 2000"}
    {"reviewerID": "A1FP2LA6M2OJX0", "asin": "0005019281", "reviewerName": "R. Holman \"the_holmboy\"", "helpful": [0, 0], "reviewText": "A friend put me on to this a few years back when he asked me to find it for him on DVD.  A Christmas Carol is a yearly read for me (at least once) and the Patrick Stewart version, being well-casted and closest to the book text, is also a yearly event, for me.  I also like the George C. Scott version, however, with reservations as other reviews mentioned - the annoying changes on some of the key points of the story.  That is to give you an idea where I am coming from with this version.  The title describes what you're getting - the Christmas Carol story with an American flavor.  Henry Winkler is excellent and, considering the time in which this was made, the production value is fairly good!!  Dorian Harewood is my favorite of the three \"ghosts\" who visit him and (SPOILER ALERT) I like the twist of having the visiting ghosts be the same people he was mistreating.  Depression-era America doesn't have nearly the \"romantic\" quality that Victorian England does, but it works well with the story.  Overall, a worthy addition to your collection of Christmas Carol movies.  Also, kudos to Image entertainment for re-releasing this at a reasonable price and getting rid of the dreaded snap-case.", "overall": 5.0, "summary": "Well named, good casting and Winkler is superb", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
    {"reviewerID": "A2BU6DHJ26RCZO", "asin": "0005019281", "reviewerName": "R. H. Powell IV", "helpful": [0, 1], "reviewText": "this movie just did not live up to the expectations of other Christmas Carol movies.... it seem contrived and was not very well put together", "overall": 2.0, "summary": "not great", "unixReviewTime": 1387756800, "reviewTime": "12 23, 2013"}
    {"reviewerID": "A6RVT4SPVTVSF", "asin": "0005019281", "reviewerName": "Richard Beckler", "helpful": [0, 0], "reviewText": "Nice rendition on classic movie.  Henry Winkler does a good job of playing a Scrooge type character.  Worth seeing this time of year.", "overall": 3.0, "summary": "Worth a view.", "unixReviewTime": 1386720000, "reviewTime": "12 11, 2013"}
    {"reviewerID": "A3OSSW7565YMCL", "asin": "0005019281", "reviewerName": "Richard Squires", "helpful": [0, 0], "reviewText": "I gave this a 5 because it gets close to home about how we should care for one another. The other ones are good but this one actually shows us a picture of how America should be. Also, the quality of the dvd was excellent.", "overall": 5.0, "summary": "American Christmas Carol: Highly recommended.", "unixReviewTime": 1358640000, "reviewTime": "01 20, 2013"}
    {"reviewerID": "A1X3WQV4P306TY", "asin": "0005019281", "reviewerName": "Robert A. Bower", "helpful": [0, 0], "reviewText": "This is a cute adaptation of the classic Scrooge story. Henry Winkler comes off as even meaner than the original Scrooge as portrayed in the earlier versions.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}