{"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143502", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This has some great tips as always and is helping me to complete my Good Eats collection.  I haven't tried any of the recipes yet, but I will soon.  Sometimes it's just lovely to let Alton entertain us.", "overall": 5.0, "summary": "Alton... nough said", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143529", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This is a great pastry guide.  I love how Alton's collections can break it down so baking isn't so mystical and scary.  I might even try some of these recipes some day.", "overall": 5.0, "summary": "Ah Alton...", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "AH3QC2PC1VTGP", "asin": "0000143561", "reviewerName": "Great Home Cook", "helpful": [2, 4], "reviewText": "I have to admit that I am a fan of Giada's cooking and I had great expectations when I ordered this set. They were however, crushed. While I still love Giada's cooking, this set is just a way for Food Network to make money. They really cheated with these DVD's. All they have are the video from the show, no text recipes, no link to the on line shows and no computer support. They play in Windows media player but the set does not contain the recipes. You can get more by taping the shows and then going to the web to download recipes. Another disappointment is the so so transfer quality to DVD. Perhaps I've been spoiled by HD and Tivo but the older shows I've recorded have had better playback quality than the episodes on the DVD's. It is in the old 480p but the quality of the transfer to DVD is dark and about the same quality as your average old VHS tape, not DVD quality. I get the impression Food Network got cheap and subbed out the DVD transfer to the lowest bidder (China?) and it shows.I could watch Giada read the dictionary and her cooking is really first rate. But, that's all you get is watching Giada. Thank god she is easy to understand and her recipes are easy to follow. But to get consistent results on some of the dishes, you should search the web and find the hard copies.  While Giada herself is great, this set is a waste of money. You're better off recording the shows and going to the web to get the recipes you want or, better yet, just stick with her cookbooks which are all first rate and worlds above this cheap presentation.", "overall": 2.0, "summary": "Don't waste your money", "unixReviewTime": 1216252800, "reviewTime": "07 17, 2008"}
{"reviewerID": "A3LKP6WPMP9UKX", "asin": "0000143588", "reviewerName": "Anna V. Carroll", "helpful": [9, 9], "reviewText": "I bought these two volumes new and spent over $50 doing so.  You get two DVDs with three discs in each. Why would I buy DVDs if I have the cookbooks? I find watching Ina Garten cook in her kitchen very relaxing after a hectic day.  SHE is doing the cooking, not me.  SHE is having to clean up, not me.  Of course we all know she has a team to do all the prep work and clean up, but we can pretend, can't we? Lots of her earlier episodes with lots of food and friends. Lemon cakes, shrimp dishes, brownies, salads, entrees. I recently made her Szechuan Noodles and the first bowl cost me $40! That's 'cause I didn't have any of the ingredients you need to make it! But once you splurge on all the condiments, you're home free.  I have eaten Szechuan Noodles all week! I can't get enough of her recipe. Hot, cold, warm. They are SO good! That recipe is on the DVD as well. She isn't cutesy like a lot of the Food Network people.  I really dislike that.  Cute doesn't work for me.  I want someone with substance who knows what she's doing. Ina Garten is that gal. You can buy them new, like I did, or used.  Just get them both! You will find yourself in your kitchen at odd hours of the night cooking something! They're addictive. Hope she comes out with Volumes 3, 4 and on.", "overall": 5.0, "summary": "VOLUME 1 & VOLUME 2-BETTER THAN THERAPY", "unixReviewTime": 1236902400, "reviewTime": "03 13, 2009"}
{"reviewerID": "AVIY68KEPQ5ZD", "asin": "0000143588", "reviewerName": "Rebecca Millington", "helpful": [1, 4], "reviewText": "I am very pleased with the dvd only wish i could get the only volume but unfortunately it cannot be shipped to australia.", "overall": 5.0, "summary": "Barefoot Contesst Vol 2", "unixReviewTime": 1232236800, "reviewTime": "01 18, 2009"}
{"reviewerID": "A1CV1WROP5KTTW", "asin": "0000589012", "reviewerName": "Alberta M. Worth \"BertieMWorth\"", "helpful": [2, 2], "reviewText": "I have read many books and literature written on addiction and recovery, and the ones I find the most informative and helpful to those seeking knowledge and understanding are the ones written from individuals who have been there themselves. The school of hard knocks is I believe to be the best education and insights into how and what an addict thinks and acts comes from those who have been there from traditional education. I believe Joe Herzank's personal knowledge and insights. I recommend this DVD to anyone struggling with addiction. Thank God for those like Joe Herzank.", "overall": 5.0, "summary": "\"Why Don't They Just Qiut\" DVD Roundtable Discussion", "unixReviewTime": 1309651200, "reviewTime": "07 3, 2011"}
{"reviewerID": "AP57WZ2X4G0AA", "asin": "0000589012", "reviewerName": "Amy Arnett-German", "helpful": [0, 1], "reviewText": "The information is good, but the presentation is very dry.  I fast-forwarded through a lot of it and wouldn't use it to show to a group as I had intended.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}
{"reviewerID": "A3NMBJ2LCRCATT", "asin": "0000589012", "reviewerName": "Carole J. Hopkins", "helpful": [1, 1], "reviewText": "I have read the original Why Don't They Just Quit and have reviewed the DVD roundtable. I appreciate the talk being so frank and uncomplicated for anyone who is just beginning the &#34;Addiction walk&#34; most specifically as a heartbroken family member. This is a difficult time for everyone. Even if the entire book/DVD doesn't address all of the readers/viewers needs it is well worth the financial investment to buy this product. I was so impressed with its contents, I contributed my own money to the Herzaneks so extra books could be purchased and distributed to those who couldn't afford them.  Heartbroken Gramma Carole", "overall": 5.0, "summary": "Very helpful", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "A5Y15SAOMX6XA", "asin": "0000589012", "reviewerName": "Catherine E. Wetzler", "helpful": [12, 16], "reviewText": "I, too, purchased this to use with my patients in early recovery, an ethnically mixed urban/suburban population who complain that their families, friends,s.o.'s \"don't get it\".  If you are purchasing this to INFORM for the first time about substance abuse and why it is difficult to \"just quit\", please choose another way.  This is overly long, meanders, imparts very little useful information, and lacks energy (I'm a therapist and it put ME to sleep). I don't think it would find a connection with an audience that is hungry for \"ah-hah\" moments and some insights into their loved one's problem.  It is basically four people (all middle aged Caucasians) sitting in a darkened room around a table asking each other what they think about a range of topics.  It could have been great--personal stories, professional insights, some science, etc., but kind of comes across as a sleepy, low budget afternoon interview show.  I will keep looking.", "overall": 2.0, "summary": "C+ At Best", "unixReviewTime": 1307404800, "reviewTime": "06 7, 2011"}
{"reviewerID": "A3P671HJ32TCSF", "asin": "0000589012", "reviewerName": "Diane Buxton", "helpful": [1, 1], "reviewText": ":Why Don't They Just Quit&#34; is a must see for those who have loved ones suffering from the disease of Addiction. Joe answers questions for us that are on this journey of being educated about this terrible disease. We show this DVD at our support group meetings on an ongoing basis.", "overall": 5.0, "summary": "A Must See", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"}